[Killed] Identical
Casts/UuidCast.php:31:9
 
     public function set(Model $model, string $key, mixed $value, array $attributes): string
     {
-        if (is_string($value) === true) {
+        if (is_string($value) !== true) {
             Assert::uuid($value);
 
killedBy: XbNz\LaravelAuditableUsers\Tests\Feature\Projectors\UserProjector\OnUserRegisteredTest::user_registered
statusReason: 1) XbNz\LaravelAuditableUsers\Tests\Feature\Projectors\UserProjector\OnUserRegisteredTest::user_registered
TypeError: XbNz\LaravelAuditableUsers\Casts\UuidCast::set(): Return value must be of type string, Ramsey\Uuid\Lazy\LazyUuidFromString returned

/Users/ag/Documents/Projects/laravel-auditable-users/src/Casts/UuidCast.php:28
/Users/ag/Documents/Projects/laravel-auditable-users/vendor/laravel/fr

[Killed] TrueValue
Casts/UuidCast.php:31:9
 
     public function set(Model $model, string $key, mixed $value, array $attributes): string
     {
-        if (is_string($value) === true) {
+        if (is_string($value) === false) {
             Assert::uuid($value);
 
killedBy: XbNz\LaravelAuditableUsers\Tests\Feature\Projectors\UserProjector\OnUserRegisteredTest::user_registered
statusReason: 1) XbNz\LaravelAuditableUsers\Tests\Feature\Projectors\UserProjector\OnUserRegisteredTest::user_registered
TypeError: XbNz\LaravelAuditableUsers\Casts\UuidCast::set(): Return value must be of type string, Ramsey\Uuid\Lazy\LazyUuidFromString returned

/Users/ag/Documents/Projects/laravel-auditable-users/src/Casts/UuidCast.php:28
/Users/ag/Documents/Projects/laravel-auditable-users/vendor/laravel/fr
