[Survived] ArrayItemRemoval
Livewire/EmailVerified.php:24:9
 
     public function render(): View
     {
-        return view('auditable-users::livewire.email-verified', [
-            'email' => $this->email,
-        ]);
+        return view('auditable-users::livewire.email-verified', []);
     }
 

[Killed] NotIdentical
Livewire/EmailVerified.php:42:9
 
         $user = User::query()->findOrFail($userUuid);
 
-        if ($user->email_verified_at !== null) {
+        if ($user->email_verified_at === null) {
             $this->addError('email', 'Email already verified');
 
killedBy: XbNz\LaravelAuditableUsers\Tests\Feature\Livewire\EmailVerifiedTest::it_confirms_an_email
statusReason: 1) XbNz\LaravelAuditableUsers\Tests\Feature\Livewire\EmailVerifiedTest::it_confirms_an_email
Illuminate\Support\ItemNotFoundException: 

/Users/ag/Documents/Projects/laravel-auditable-users/vendor/laravel/framework/src/Illuminate/Collections/Collection.php:1403
/Users/ag/Documents/Projects/laravel-auditable-users/tests/Feature/Livewire/EmailVerifiedTest.php:71

ERRORS!
Tests: 1, Assertions: 1, Err

[Killed] MethodCallRemoval
Livewire/EmailVerified.php:43:13
         $user = User::query()->findOrFail($userUuid);
 
         if ($user->email_verified_at !== null) {
-            $this->addError('email', 'Email already verified');
+            
 
             return;
killedBy: XbNz\LaravelAuditableUsers\Tests\Feature\Livewire\EmailVerifiedTest::it_throws_an_error_if_the_email_has_already_been_confirmed
statusReason: 1) XbNz\LaravelAuditableUsers\Tests\Feature\Livewire\EmailVerifiedTest::it_throws_an_error_if_the_email_has_already_been_confirmed
Component has no errors.
Failed asserting that false is true.

/Users/ag/Documents/Projects/laravel-auditable-users/vendor/livewire/livewire/src/Features/SupportValidation/TestsValidation.php:40
/Users/ag/Documents/Projects/laravel-auditable-users/tests/Feature/Livewir

[Killed] MethodCallRemoval
Livewire/EmailVerified.php:48:9
             return;
         }
 
-        $pipeline
-            ->pipe($dispatchCommand)
-            ->process(new Transporter(Uuid::fromString($userUuid), $email));
+        
     }
 }
killedBy: XbNz\LaravelAuditableUsers\Tests\Feature\Livewire\EmailVerifiedTest::it_confirms_an_email
statusReason: 1) XbNz\LaravelAuditableUsers\Tests\Feature\Livewire\EmailVerifiedTest::it_confirms_an_email
Illuminate\Support\ItemNotFoundException: 

/Users/ag/Documents/Projects/laravel-auditable-users/vendor/laravel/framework/src/Illuminate/Collections/Collection.php:1403
/Users/ag/Documents/Projects/laravel-auditable-users/tests/Feature/Livewire/EmailVerifiedTest.php:71

ERRORS!
Tests: 1, Assertions: 1, Err
