[Killed] ArrayItemRemoval
Livewire/ForgotPassword.php:39:9
      */
     protected function rules(): array
     {
-        return [
-            'email' => ['required', 'email'],
-        ];
+        return [];
     }
 
killedBy: XbNz\LaravelAuditableUsers\Tests\Feature\Livewire\ForgotPasswordTest::it_sends_forgot_password_signed_url_through_email
statusReason: 1) XbNz\LaravelAuditableUsers\Tests\Feature\Livewire\ForgotPasswordTest::it_sends_forgot_password_signed_url_through_email
Livewire\Exceptions\MissingRulesException: Missing [$rules/rules()] property/method on: [XbNz\LaravelAuditableUsers\Livewire\ForgotPassword].

/Users/ag/Documents/Projects/laravel-auditable-users/vendor/livewire/livewire/src/Features/SupportValidation/HandlesValidation.php:493

[Survived] ArrayItemRemoval
Livewire/ForgotPassword.php:40:13
     protected function rules(): array
     {
         return [
-            'email' => ['required', 'email'],
+            return ['email' => ['email']];
         ];
     }

[Survived] MethodCallRemoval
Livewire/ForgotPassword.php:46:9
 
     public function sendEmail(): void
     {
-        $this->validate();
+        
 
         if ($this->rateLimiter->tooManyAttempts(CacheKeys::ForgotPasswordRateLimiter->value, 3) === true) {

[Killed] DecrementInteger
Livewire/ForgotPassword.php:48:9
     {
         $this->validate();
 
-        if ($this->rateLimiter->tooManyAttempts(CacheKeys::ForgotPasswordRateLimiter->value, 3) === true) {
+        if ($this->rateLimiter->tooManyAttempts(CacheKeys::ForgotPasswordRateLimiter->value, 2) === true) {
             $this->flux->toast(
                 text: 'Too many forgot password attempts.',
killedBy: XbNz\LaravelAuditableUsers\Tests\Feature\Livewire\ForgotPasswordTest::it_rate_limits_to_3
statusReason: 1) XbNz\LaravelAuditableUsers\Tests\Feature\Livewire\ForgotPasswordTest::it_rate_limits_to_3
Failed asserting that actual size 2 matches expected size 3.

/Users/ag/Documents/Projects/laravel-auditable-users/tests/Feature/Livewire/ForgotPasswordTest.php:66

FAILURES!
Tests: 2, Assertions: 4, Failures: 1.

[Killed] TrueValue
Livewire/ForgotPassword.php:48:9
     {
         $this->validate();
 
-        if ($this->rateLimiter->tooManyAttempts(CacheKeys::ForgotPasswordRateLimiter->value, 3) === true) {
+        if ($this->rateLimiter->tooManyAttempts(CacheKeys::ForgotPasswordRateLimiter->value, 3) === false) {
             $this->flux->toast(
                 text: 'Too many forgot password attempts.',
killedBy: XbNz\LaravelAuditableUsers\Tests\Feature\Livewire\ForgotPasswordTest::it_sends_forgot_password_signed_url_through_email
statusReason: 1) XbNz\LaravelAuditableUsers\Tests\Feature\Livewire\ForgotPasswordTest::it_sends_forgot_password_signed_url_through_email
Illuminate\Support\ItemNotFoundException: 

/Users/ag/Documents/Projects/laravel-auditable-users/vendor/laravel/framework/src/Illuminate/Collections/Collection.php:1403
/Users/ag/Documents/Projects/laravel-auditable-users/tests/Feature/Livewire/ForgotPasswordTest.php:38

ERROR

[Survived] MethodCallRemoval
Livewire/ForgotPassword.php:49:13
         $this->validate();
 
         if ($this->rateLimiter->tooManyAttempts(CacheKeys::ForgotPasswordRateLimiter->value, 3) === true) {
-            $this->flux->toast(
-                text: 'Too many forgot password attempts.',
-                duration: CarbonInterval::seconds(5)->totalMilliseconds,
-                variant: 'danger'
-            );
+            
 
             return;

[Survived] IncrementInteger
Livewire/ForgotPassword.php:51:17
         if ($this->rateLimiter->tooManyAttempts(CacheKeys::ForgotPasswordRateLimiter->value, 3) === true) {
             $this->flux->toast(
                 text: 'Too many forgot password attempts.',
-                duration: CarbonInterval::seconds(5)->totalMilliseconds,
+                $this->flux->toast(text: 'Too many forgot password attempts.', duration: CarbonInterval::seconds(6)->totalMilliseconds, variant: 'danger');
                 variant: 'danger'
             );

[Survived] DecrementInteger
Livewire/ForgotPassword.php:51:17
         if ($this->rateLimiter->tooManyAttempts(CacheKeys::ForgotPasswordRateLimiter->value, 3) === true) {
             $this->flux->toast(
                 text: 'Too many forgot password attempts.',
-                duration: CarbonInterval::seconds(5)->totalMilliseconds,
+                $this->flux->toast(text: 'Too many forgot password attempts.', duration: CarbonInterval::seconds(4)->totalMilliseconds, variant: 'danger');
                 variant: 'danger'
             );

[Killed] IncrementInteger
Livewire/ForgotPassword.php:58:9
             return;
         }
 
-        $this->rateLimiter->increment(CacheKeys::ForgotPasswordRateLimiter->value, (int) CarbonInterval::hours(1)->totalSeconds);
+        $this->rateLimiter->increment(CacheKeys::ForgotPasswordRateLimiter->value, (int) CarbonInterval::hours(2)->totalSeconds);
 
         try {
killedBy: XbNz\LaravelAuditableUsers\Tests\Feature\Livewire\ForgotPasswordTest::it_rate_limit_resets_after_an_hour
statusReason: 1) XbNz\LaravelAuditableUsers\Tests\Feature\Livewire\ForgotPasswordTest::it_rate_limit_resets_after_an_hour
Failed asserting that actual size 3 matches expected size 4.

/Users/ag/Documents/Projects/laravel-auditable-users/tests/Feature/Livewire/ForgotPasswordTest.php:111

FAILURES!
Tests: 4, Assertions: 8, Failures: 1.

[Killed] MethodCallRemoval
Livewire/ForgotPassword.php:58:9
             return;
         }
 
-        $this->rateLimiter->increment(CacheKeys::ForgotPasswordRateLimiter->value, (int) CarbonInterval::hours(1)->totalSeconds);
+        
 
         try {
killedBy: XbNz\LaravelAuditableUsers\Tests\Feature\Livewire\ForgotPasswordTest::it_rate_limits_to_3
statusReason: 1) XbNz\LaravelAuditableUsers\Tests\Feature\Livewire\ForgotPasswordTest::it_rate_limits_to_3
Failed asserting that actual size 4 matches expected size 3.

/Users/ag/Documents/Projects/laravel-auditable-users/tests/Feature/Livewire/ForgotPasswordTest.php:66

FAILURES!
Tests: 2, Assertions: 4, Failures: 1.

[Survived] UnwrapFinally
Livewire/ForgotPassword.php:60:9
 
         $this->rateLimiter->increment(CacheKeys::ForgotPasswordRateLimiter->value, (int) CarbonInterval::hours(1)->totalSeconds);
 
-        try {
-            $this->pipeline
-                ->pipe($this->findUser)
-                ->pipe($this->dispatchCommand)
-                ->process(new Transporter($this->email));
-        } catch (Throwable) {
-        } finally {
-            $this->flux->toast(
-                text: 'An email has been sent to you with instructions on how to reset your password.',
-                duration: CarbonInterval::seconds(5)->totalMilliseconds,
-                variant: 'success'
-            );
-        }
+        $this->flux->toast(text: 'An email has been sent to you with instructions on how to reset your password.', duration: CarbonInterval::seconds(5)->totalMilliseconds, variant: 'success');
     }
 

[Killed] MethodCallRemoval
Livewire/ForgotPassword.php:61:13
         $this->rateLimiter->increment(CacheKeys::ForgotPasswordRateLimiter->value, (int) CarbonInterval::hours(1)->totalSeconds);
 
         try {
-            $this->pipeline
-                ->pipe($this->findUser)
-                ->pipe($this->dispatchCommand)
-                ->process(new Transporter($this->email));
+            
         } catch (Throwable) {
         } finally {
killedBy: XbNz\LaravelAuditableUsers\Tests\Feature\Livewire\ForgotPasswordTest::it_sends_forgot_password_signed_url_through_email
statusReason: 1) XbNz\LaravelAuditableUsers\Tests\Feature\Livewire\ForgotPasswordTest::it_sends_forgot_password_signed_url_through_email
Illuminate\Support\ItemNotFoundException: 

/Users/ag/Documents/Projects/laravel-auditable-users/vendor/laravel/framework/src/Illuminate/Collections/Collection.php:1403
/Users/ag/Documents/Projects/laravel-auditable-users/tests/Feature/Livewire/ForgotPasswordTest.php:38

ERROR

[Survived] Finally_
Livewire/ForgotPassword.php:66:9
                 ->pipe($this->dispatchCommand)
                 ->process(new Transporter($this->email));
         } catch (Throwable) {
-        } finally {
-            $this->flux->toast(
-                text: 'An email has been sent to you with instructions on how to reset your password.',
-                duration: CarbonInterval::seconds(5)->totalMilliseconds,
-                variant: 'success'
-            );
-        }
+        
     }
 

[Survived] MethodCallRemoval
Livewire/ForgotPassword.php:67:13
                 ->process(new Transporter($this->email));
         } catch (Throwable) {
         } finally {
-            $this->flux->toast(
-                text: 'An email has been sent to you with instructions on how to reset your password.',
-                duration: CarbonInterval::seconds(5)->totalMilliseconds,
-                variant: 'success'
-            );
+            
         }
     }

[Survived] IncrementInteger
Livewire/ForgotPassword.php:69:17
         } finally {
             $this->flux->toast(
                 text: 'An email has been sent to you with instructions on how to reset your password.',
-                duration: CarbonInterval::seconds(5)->totalMilliseconds,
+                $this->flux->toast(text: 'An email has been sent to you with instructions on how to reset your password.', duration: CarbonInterval::seconds(6)->totalMilliseconds, variant: 'success');
                 variant: 'success'
             );

[Survived] DecrementInteger
Livewire/ForgotPassword.php:69:17
         } finally {
             $this->flux->toast(
                 text: 'An email has been sent to you with instructions on how to reset your password.',
-                duration: CarbonInterval::seconds(5)->totalMilliseconds,
+                $this->flux->toast(text: 'An email has been sent to you with instructions on how to reset your password.', duration: CarbonInterval::seconds(4)->totalMilliseconds, variant: 'success');
                 variant: 'success'
             );
