[Survived] ArrayItemRemoval
Livewire/Login.php:62:9
      */
     protected function rules(): array
     {
-        return [
-            'email' => ['required', 'email'],
-            'password' => ['required'],
-            'remember' => ['boolean'],
-        ];
+        return ['password' => ['required'], 'remember' => ['boolean']];
     }
 

[Survived] ArrayItemRemoval
Livewire/Login.php:64:13
     {
         return [
             'email' => ['required', 'email'],
-            'password' => ['required'],
+            return ['email' => ['required', 'email'], 'password' => [], 'remember' => ['boolean']];
             'remember' => ['boolean'],
         ];

[Killed] DecrementInteger
Livewire/Login.php:71:9
 
     public function login(): void
     {
-        if ($this->rateLimiter->tooManyAttempts(CacheKeys::LoginRateLimiter->value, 3) === true) {
+        if ($this->rateLimiter->tooManyAttempts(CacheKeys::LoginRateLimiter->value, 2) === true) {
             $this->flux->toast(
                 text: 'Too many login attempts.',
killedBy: XbNz\LaravelAuditableUsers\Tests\Feature\Livewire\LoginTest::it_rate_limits_logins_to_3
statusReason: 1) XbNz\LaravelAuditableUsers\Tests\Feature\Livewire\LoginTest::it_rate_limits_logins_to_3
The user is not authenticated
Failed asserting that false is true.

/Users/ag/Documents/Projects/laravel-auditable-users/vendor/laravel/framework/src/Illuminate/Foundation/Testing/Concerns/InteractsWithAuthentication.php:49
/Users/ag/Documents/Projects/laravel-auditable-users/tests/Feature/Livewire/LoginTest

[Killed] IncrementInteger
Livewire/Login.php:71:9
 
     public function login(): void
     {
-        if ($this->rateLimiter->tooManyAttempts(CacheKeys::LoginRateLimiter->value, 3) === true) {
+        if ($this->rateLimiter->tooManyAttempts(CacheKeys::LoginRateLimiter->value, 4) === true) {
             $this->flux->toast(
                 text: 'Too many login attempts.',
killedBy: XbNz\LaravelAuditableUsers\Tests\Feature\Livewire\LoginTest::it_rate_limits_logins_to_3
statusReason: 1) XbNz\LaravelAuditableUsers\Tests\Feature\Livewire\LoginTest::it_rate_limits_logins_to_3
The user is authenticated
Failed asserting that true is false.

/Users/ag/Documents/Projects/laravel-auditable-users/vendor/laravel/framework/src/Illuminate/Foundation/Testing/Concerns/InteractsWithAuthentication.php:62
/Users/ag/Documents/Projects/laravel-auditable-users/tests/Feature/Livewire/LoginTest.php

[Survived] MethodCallRemoval
Livewire/Login.php:72:13
     public function login(): void
     {
         if ($this->rateLimiter->tooManyAttempts(CacheKeys::LoginRateLimiter->value, 3) === true) {
-            $this->flux->toast(
-                text: 'Too many login attempts.',
-                duration: CarbonInterval::seconds(5)->totalMilliseconds,
-                variant: 'danger'
-            );
+            
 
             return;

[Survived] IncrementInteger
Livewire/Login.php:74:17
         if ($this->rateLimiter->tooManyAttempts(CacheKeys::LoginRateLimiter->value, 3) === true) {
             $this->flux->toast(
                 text: 'Too many login attempts.',
-                duration: CarbonInterval::seconds(5)->totalMilliseconds,
+                $this->flux->toast(text: 'Too many login attempts.', duration: CarbonInterval::seconds(6)->totalMilliseconds, variant: 'danger');
                 variant: 'danger'
             );

[Survived] DecrementInteger
Livewire/Login.php:74:17
         if ($this->rateLimiter->tooManyAttempts(CacheKeys::LoginRateLimiter->value, 3) === true) {
             $this->flux->toast(
                 text: 'Too many login attempts.',
-                duration: CarbonInterval::seconds(5)->totalMilliseconds,
+                $this->flux->toast(text: 'Too many login attempts.', duration: CarbonInterval::seconds(4)->totalMilliseconds, variant: 'danger');
                 variant: 'danger'
             );

[Killed] MethodCallRemoval
Livewire/Login.php:81:9
             return;
         }
 
-        $this->rateLimiter->increment(CacheKeys::LoginRateLimiter->value, (int) CarbonInterval::seconds(60)->totalSeconds);
+        
 
         $this->validate();
killedBy: XbNz\LaravelAuditableUsers\Tests\Feature\Livewire\LoginTest::it_rate_limits_logins_to_3
statusReason: 1) XbNz\LaravelAuditableUsers\Tests\Feature\Livewire\LoginTest::it_rate_limits_logins_to_3
The user is authenticated
Failed asserting that true is false.

/Users/ag/Documents/Projects/laravel-auditable-users/vendor/laravel/framework/src/Illuminate/Foundation/Testing/Concerns/InteractsWithAuthentication.php:62
/Users/ag/Documents/Projects/laravel-auditable-users/tests/Feature/Livewire/LoginTest.php

[Killed] IncrementInteger
Livewire/Login.php:81:9
             return;
         }
 
-        $this->rateLimiter->increment(CacheKeys::LoginRateLimiter->value, (int) CarbonInterval::seconds(60)->totalSeconds);
+        $this->rateLimiter->increment(CacheKeys::LoginRateLimiter->value, (int) CarbonInterval::seconds(61)->totalSeconds);
 
         $this->validate();
killedBy: XbNz\LaravelAuditableUsers\Tests\Feature\Livewire\LoginTest::rate_limit_resets_after_a_minute
statusReason: 1) XbNz\LaravelAuditableUsers\Tests\Feature\Livewire\LoginTest::rate_limit_resets_after_a_minute
The user is not authenticated
Failed asserting that false is true.

/Users/ag/Documents/Projects/laravel-auditable-users/vendor/laravel/framework/src/Illuminate/Foundation/Testing/Concerns/InteractsWithAuthentication.php:49
/Users/ag/Documents/Projects/laravel-auditable-users/tests/Feature/Livewire/Log

[Survived] MethodCallRemoval
Livewire/Login.php:83:9
 
         $this->rateLimiter->increment(CacheKeys::LoginRateLimiter->value, (int) CarbonInterval::seconds(60)->totalSeconds);
 
-        $this->validate();
+        
 
         $user = $this->guard->getProvider()->retrieveByCredentials($credentials = [

[Killed] Identical
Livewire/Login.php:94:9
 
         $valid = $this->guard->getProvider()->validateCredentials($user, $credentials);
 
-        if ($valid === false) {
+        if ($valid !== false) {
             $this->flux->toast(
                 'The given credentials were invalid.',
killedBy: XbNz\LaravelAuditableUsers\Tests\Feature\Livewire\LoginTest::it_can_login
statusReason: 1) XbNz\LaravelAuditableUsers\Tests\Feature\Livewire\LoginTest::it_can_login
Component did not perform a redirect.
Failed asserting that an array has the key 'redirect'.

/Users/ag/Documents/Projects/laravel-auditable-users/vendor/livewire/livewire/src/Features/SupportRedirects/TestsRedirects.php:23
/Users/ag/Documents/Projects/laravel-auditable-users/vendor/livewire/livewire/src/Features/SupportR

[Killed] FalseValue
Livewire/Login.php:94:9
 
         $valid = $this->guard->getProvider()->validateCredentials($user, $credentials);
 
-        if ($valid === false) {
+        if ($valid === true) {
             $this->flux->toast(
                 'The given credentials were invalid.',
killedBy: XbNz\LaravelAuditableUsers\Tests\Feature\Livewire\LoginTest::it_can_login
statusReason: 1) XbNz\LaravelAuditableUsers\Tests\Feature\Livewire\LoginTest::it_can_login
Component did not perform a redirect.
Failed asserting that an array has the key 'redirect'.

/Users/ag/Documents/Projects/laravel-auditable-users/vendor/livewire/livewire/src/Features/SupportRedirects/TestsRedirects.php:23
/Users/ag/Documents/Projects/laravel-auditable-users/vendor/livewire/livewire/src/Features/SupportR

[Survived] MethodCallRemoval
Livewire/Login.php:95:13
         $valid = $this->guard->getProvider()->validateCredentials($user, $credentials);
 
         if ($valid === false) {
-            $this->flux->toast(
-                'The given credentials were invalid.',
-                'Invalid credentials',
-                CarbonInterval::seconds(5)->totalMilliseconds,
-                'danger'
-            );
+            
 
             return;

[Survived] DecrementInteger
Livewire/Login.php:98:17
             $this->flux->toast(
                 'The given credentials were invalid.',
                 'Invalid credentials',
-                CarbonInterval::seconds(5)->totalMilliseconds,
+                $this->flux->toast('The given credentials were invalid.', 'Invalid credentials', CarbonInterval::seconds(4)->totalMilliseconds, 'danger');
                 'danger'
             );

[Survived] IncrementInteger
Livewire/Login.php:98:17
             $this->flux->toast(
                 'The given credentials were invalid.',
                 'Invalid credentials',
-                CarbonInterval::seconds(5)->totalMilliseconds,
+                $this->flux->toast('The given credentials were invalid.', 'Invalid credentials', CarbonInterval::seconds(6)->totalMilliseconds, 'danger');
                 'danger'
             );

[Killed] Identical
Livewire/Login.php:105:9
             return;
         }
 
-        if ($this->remember === true) {
+        if ($this->remember !== true) {
             $user->setRememberToken($token = Str::random(60));
         }
killedBy: XbNz\LaravelAuditableUsers\Tests\Feature\Livewire\LoginTest::it_rate_limits_logins_to_3
statusReason: 1) XbNz\LaravelAuditableUsers\Tests\Feature\Livewire\LoginTest::it_rate_limits_logins_to_3
Spatie\EventSourcing\Projections\Exceptions\ReadonlyProjection: The `XbNz\LaravelAuditableUsers\Projections\User` projection is not writeable at this point, please call `$model->writeable()` first.

/Users/ag/Documents/Projects/laravel-auditable-users/vendor/spatie/laravel-event-sourcing/src/Projections/Exce

[Killed] TrueValue
Livewire/Login.php:105:9
             return;
         }
 
-        if ($this->remember === true) {
+        if ($this->remember === false) {
             $user->setRememberToken($token = Str::random(60));
         }
killedBy: XbNz\LaravelAuditableUsers\Tests\Feature\Livewire\LoginTest::it_rate_limits_logins_to_3
statusReason: 1) XbNz\LaravelAuditableUsers\Tests\Feature\Livewire\LoginTest::it_rate_limits_logins_to_3
Spatie\EventSourcing\Projections\Exceptions\ReadonlyProjection: The `XbNz\LaravelAuditableUsers\Projections\User` projection is not writeable at this point, please call `$model->writeable()` first.

/Users/ag/Documents/Projects/laravel-auditable-users/vendor/spatie/laravel-event-sourcing/src/Projections/Exce

[Killed] MethodCallRemoval
Livewire/Login.php:106:13
         }
 
         if ($this->remember === true) {
-            $user->setRememberToken($token = Str::random(60));
+            
         }
 
killedBy: XbNz\LaravelAuditableUsers\Tests\Feature\Livewire\LoginTest::remember_me_functionality_works
statusReason: 1) XbNz\LaravelAuditableUsers\Tests\Feature\Livewire\LoginTest::remember_me_functionality_works
Spatie\EventSourcing\Projections\Exceptions\ReadonlyProjection: The `XbNz\LaravelAuditableUsers\Projections\User` projection is not writeable at this point, please call `$model->writeable()` first.

/Users/ag/Documents/Projects/laravel-auditable-users/vendor/spatie/laravel-event-sourcing/src/Projections

[Survived] DecrementInteger
Livewire/Login.php:106:13
         }
 
         if ($this->remember === true) {
-            $user->setRememberToken($token = Str::random(60));
+            $user->setRememberToken($token = Str::random(59));
         }
 

[Killed] MethodCallRemoval
Livewire/Login.php:109:9
             $user->setRememberToken($token = Str::random(60));
         }
 
-        $this->guard->login($user, $this->remember);
+        
 
         $this->session->regenerate();
killedBy: XbNz\LaravelAuditableUsers\Tests\Feature\Livewire\LoginTest::it_can_login
statusReason: 1) XbNz\LaravelAuditableUsers\Tests\Feature\Livewire\LoginTest::it_can_login
ErrorException: Attempt to read property "uuid" on null

/Users/ag/Documents/Projects/laravel-auditable-users/vendor/laravel/framework/src/Illuminate/Foundation/Bootstrap/HandleExceptions.php:256
/Users/ag/Documents/Projects/laravel-auditable-users/tests/Feature/Livewire/LoginTest.php:76

ERRORS!
Tests: 1, Assertions: 4,

[Survived] MethodCallRemoval
Livewire/Login.php:111:9
 
         $this->guard->login($user, $this->remember);
 
-        $this->session->regenerate();
+        
 
         $this->pipeline

[Killed] MethodCallRemoval
Livewire/Login.php:113:9
 
         $this->session->regenerate();
 
-        $this->pipeline
-            ->pipe($this->extractIp)
-            ->pipe($this->extractUserAgent)
-            ->pipe($this->dispatchCommand)
-            ->process(new Transporter(
-                $user->uuid,
-                $this->request,
-                $this->email,
-                $token ?? null
-            ));
+        
 
         $this->redirectRoute(
killedBy: XbNz\LaravelAuditableUsers\Tests\Feature\Livewire\LoginTest::remember_me_functionality_works
statusReason: 1) XbNz\LaravelAuditableUsers\Tests\Feature\Livewire\LoginTest::remember_me_functionality_works
Illuminate\Support\ItemNotFoundException: 

/Users/ag/Documents/Projects/laravel-auditable-users/vendor/laravel/framework/src/Illuminate/Collections/Collection.php:1403
/Users/ag/Documents/Projects/laravel-auditable-users/tests/Feature/Livewire/LoginTest.php:209

ERRORS!
Tests: 6, Assertions: 17, Errors

[Killed] MethodCallRemoval
Livewire/Login.php:124:9
                 $token ?? null
             ));
 
-        $this->redirectRoute(
-            name: $this->config->get('auditable-users.redirect_after_login'),
-            navigate: true
-        );
+        
     }
 
killedBy: XbNz\LaravelAuditableUsers\Tests\Feature\Livewire\LoginTest::it_can_login
statusReason: 1) XbNz\LaravelAuditableUsers\Tests\Feature\Livewire\LoginTest::it_can_login
Component did not perform a redirect.
Failed asserting that an array has the key 'redirect'.

/Users/ag/Documents/Projects/laravel-auditable-users/vendor/livewire/livewire/src/Features/SupportRedirects/TestsRedirects.php:23
/Users/ag/Documents/Projects/laravel-auditable-users/vendor/livewire/livewire/src/Features/SupportR

[Survived] TrueValue
Livewire/Login.php:126:13
 
         $this->redirectRoute(
             name: $this->config->get('auditable-users.redirect_after_login'),
-            navigate: true
+            $this->redirectRoute(name: $this->config->get('auditable-users.redirect_after_login'), navigate: false);
         );
     }
