[Survived] ArrayItemRemoval
Livewire/Register.php:47:13
     public function rules(): array
     {
         return [
-            'email' => [
-                'required',
-                'email',
-                new Unique(User::class, 'email'),
-            ],
+            return ['email' => ['email', new Unique(User::class, 'email')], 'password' => ['required', Password::min(8)->uncompromised()]];
             'password' => [
                 'required',

[Survived] DecrementInteger
Livewire/Register.php:54:17
             ],
             'password' => [
                 'required',
-                Password::min(8)->uncompromised(),
+                return ['email' => ['required', 'email', new Unique(User::class, 'email')], 'password' => ['required', Password::min(7)->uncompromised()]];
             ],
         ];

[Survived] IncrementInteger
Livewire/Register.php:54:17
             ],
             'password' => [
                 'required',
-                Password::min(8)->uncompromised(),
+                return ['email' => ['required', 'email', new Unique(User::class, 'email')], 'password' => ['required', Password::min(9)->uncompromised()]];
             ],
         ];

[Killed] DecrementInteger
Livewire/Register.php:61:9
 
     public function register(): void
     {
-        if ($this->rateLimiter->tooManyAttempts(CacheKeys::RegisterRateLimiter->value, 3) === true) {
+        if ($this->rateLimiter->tooManyAttempts(CacheKeys::RegisterRateLimiter->value, 2) === true) {
             $this->flux->toast(
                 text: 'Too many registration attempts.',
killedBy: XbNz\LaravelAuditableUsers\Tests\Feature\Livewire\RegisterTest::it_rate_limits_registration_to_3_per_day
statusReason: 1) XbNz\LaravelAuditableUsers\Tests\Feature\Livewire\RegisterTest::it_rate_limits_registration_to_3_per_day
Failed asserting that table [users] matches expected entries count of 4. Entries found: 3.
.

/Users/ag/Documents/Projects/laravel-auditable-users/vendor/laravel/framework/src/Illuminate/Foundation/Testing/Concerns/InteractsWithDatabase.php:79
/Users/ag/Documents/Projects/laravel-auditable-u

[Killed] IncrementInteger
Livewire/Register.php:61:9
 
     public function register(): void
     {
-        if ($this->rateLimiter->tooManyAttempts(CacheKeys::RegisterRateLimiter->value, 3) === true) {
+        if ($this->rateLimiter->tooManyAttempts(CacheKeys::RegisterRateLimiter->value, 4) === true) {
             $this->flux->toast(
                 text: 'Too many registration attempts.',
killedBy: XbNz\LaravelAuditableUsers\Tests\Feature\Livewire\RegisterTest::it_rate_limits_registration_to_3_per_day
statusReason: 1) XbNz\LaravelAuditableUsers\Tests\Feature\Livewire\RegisterTest::it_rate_limits_registration_to_3_per_day
Failed asserting that table [users] matches expected entries count of 4. Entries found: 5.
.

/Users/ag/Documents/Projects/laravel-auditable-users/vendor/laravel/framework/src/Illuminate/Foundation/Testing/Concerns/InteractsWithDatabase.php:79
/Users/ag/Documents/Projects/laravel-auditable-u

[Survived] MethodCallRemoval
Livewire/Register.php:62:13
     public function register(): void
     {
         if ($this->rateLimiter->tooManyAttempts(CacheKeys::RegisterRateLimiter->value, 3) === true) {
-            $this->flux->toast(
-                text: 'Too many registration attempts.',
-                duration: CarbonInterval::seconds(5)->totalMilliseconds,
-                variant: 'danger'
-            );
+            
 
             return;

[Survived] DecrementInteger
Livewire/Register.php:64:17
         if ($this->rateLimiter->tooManyAttempts(CacheKeys::RegisterRateLimiter->value, 3) === true) {
             $this->flux->toast(
                 text: 'Too many registration attempts.',
-                duration: CarbonInterval::seconds(5)->totalMilliseconds,
+                $this->flux->toast(text: 'Too many registration attempts.', duration: CarbonInterval::seconds(4)->totalMilliseconds, variant: 'danger');
                 variant: 'danger'
             );

[Survived] IncrementInteger
Livewire/Register.php:64:17
         if ($this->rateLimiter->tooManyAttempts(CacheKeys::RegisterRateLimiter->value, 3) === true) {
             $this->flux->toast(
                 text: 'Too many registration attempts.',
-                duration: CarbonInterval::seconds(5)->totalMilliseconds,
+                $this->flux->toast(text: 'Too many registration attempts.', duration: CarbonInterval::seconds(6)->totalMilliseconds, variant: 'danger');
                 variant: 'danger'
             );

[Killed] MethodCallRemoval
Livewire/Register.php:80:9
             )
         );
 
-        $this->pipeline
-            ->pipe($this->hashPasswordStage)
-            ->pipe($this->dispatchCommandStage)
-            ->process($transporter);
+        
 
         $this->rateLimiter->increment(CacheKeys::RegisterRateLimiter->value, (int) CarbonInterval::days(1)->totalSeconds);
killedBy: XbNz\LaravelAuditableUsers\Tests\Feature\Livewire\RegisterTest::it_registers_a_user
statusReason: 1) XbNz\LaravelAuditableUsers\Tests\Feature\Livewire\RegisterTest::it_registers_a_user
Illuminate\Database\Eloquent\ModelNotFoundException: No query results for model [XbNz\LaravelAuditableUsers\Projections\User].

/Users/ag/Documents/Projects/laravel-auditable-users/vendor/laravel/framework/src/Illuminate/Database/Eloquent/Builder.php:730
/Users/ag/Documents/Projects/laravel-auditable-users/tests

[Killed] IncrementInteger
Livewire/Register.php:85:9
             ->pipe($this->dispatchCommandStage)
             ->process($transporter);
 
-        $this->rateLimiter->increment(CacheKeys::RegisterRateLimiter->value, (int) CarbonInterval::days(1)->totalSeconds);
+        $this->rateLimiter->increment(CacheKeys::RegisterRateLimiter->value, (int) CarbonInterval::days(2)->totalSeconds);
 
         $this->flux->toast(
killedBy: XbNz\LaravelAuditableUsers\Tests\Feature\Livewire\RegisterTest::it_rate_limits_registration_to_3_per_day
statusReason: 1) XbNz\LaravelAuditableUsers\Tests\Feature\Livewire\RegisterTest::it_rate_limits_registration_to_3_per_day
Failed asserting that table [users] matches expected entries count of 4. Entries found: 3.
.

/Users/ag/Documents/Projects/laravel-auditable-users/vendor/laravel/framework/src/Illuminate/Foundation/Testing/Concerns/InteractsWithDatabase.php:79
/Users/ag/Documents/Projects/laravel-auditable-u

[Killed] MethodCallRemoval
Livewire/Register.php:85:9
             ->pipe($this->dispatchCommandStage)
             ->process($transporter);
 
-        $this->rateLimiter->increment(CacheKeys::RegisterRateLimiter->value, (int) CarbonInterval::days(1)->totalSeconds);
+        
 
         $this->flux->toast(
killedBy: XbNz\LaravelAuditableUsers\Tests\Feature\Livewire\RegisterTest::it_rate_limits_registration_to_3_per_day
statusReason: 1) XbNz\LaravelAuditableUsers\Tests\Feature\Livewire\RegisterTest::it_rate_limits_registration_to_3_per_day
Failed asserting that table [users] matches expected entries count of 4. Entries found: 6.
.

/Users/ag/Documents/Projects/laravel-auditable-users/vendor/laravel/framework/src/Illuminate/Foundation/Testing/Concerns/InteractsWithDatabase.php:79
/Users/ag/Documents/Projects/laravel-auditable-u

[Survived] MethodCallRemoval
Livewire/Register.php:87:9
 
         $this->rateLimiter->increment(CacheKeys::RegisterRateLimiter->value, (int) CarbonInterval::days(1)->totalSeconds);
 
-        $this->flux->toast(
-            'Confirmation email has been sent to your email address.',
-            'Confirmation email sent',
-            CarbonInterval::seconds(5)->totalMilliseconds,
-            'success'
-        );
+        
     }
 

[Survived] IncrementInteger
Livewire/Register.php:90:13
         $this->flux->toast(
             'Confirmation email has been sent to your email address.',
             'Confirmation email sent',
-            CarbonInterval::seconds(5)->totalMilliseconds,
+            $this->flux->toast('Confirmation email has been sent to your email address.', 'Confirmation email sent', CarbonInterval::seconds(6)->totalMilliseconds, 'success');
             'success'
         );

[Survived] DecrementInteger
Livewire/Register.php:90:13
         $this->flux->toast(
             'Confirmation email has been sent to your email address.',
             'Confirmation email sent',
-            CarbonInterval::seconds(5)->totalMilliseconds,
+            $this->flux->toast('Confirmation email has been sent to your email address.', 'Confirmation email sent', CarbonInterval::seconds(4)->totalMilliseconds, 'success');
             'success'
         );
