[Survived] ArrayItemRemoval
Livewire/ResetPassword.php:56:13
     public function rules(): array
     {
         return [
-            'newPassword' => [
-                'required',
-                Password::min(8)->uncompromised(),
-            ],
+            return ['newPassword' => [Password::min(8)->uncompromised()]];
         ];
     }

[Survived] IncrementInteger
Livewire/ResetPassword.php:58:17
         return [
             'newPassword' => [
                 'required',
-                Password::min(8)->uncompromised(),
+                return ['newPassword' => ['required', Password::min(9)->uncompromised()]];
             ],
         ];

[Survived] DecrementInteger
Livewire/ResetPassword.php:58:17
         return [
             'newPassword' => [
                 'required',
-                Password::min(8)->uncompromised(),
+                return ['newPassword' => ['required', Password::min(7)->uncompromised()]];
             ],
         ];

[Killed] Identical
Livewire/ResetPassword.php:71:9
             ->filter(fn (string $token) => $this->hasher->check($token, $this->token))
             ->isNotEmpty();
 
-        if ($hasMatching === false) {
+        if ($hasMatching !== false) {
             $this->flux->toast(
                 text: 'Password reset expired. Please request a new one.',
killedBy: XbNz\LaravelAuditableUsers\Tests\Feature\Livewire\ResetPasswordTest::it_resets_a_password_if_the_token_is_valid
statusReason: 1) XbNz\LaravelAuditableUsers\Tests\Feature\Livewire\ResetPasswordTest::it_resets_a_password_if_the_token_is_valid
Illuminate\Support\ItemNotFoundException: 

/Users/ag/Documents/Projects/laravel-auditable-users/vendor/laravel/framework/src/Illuminate/Collections/Collection.php:1403
/Users/ag/Documents/Projects/laravel-auditable-users/tests/Feature/Livewire/ResetPasswordTest.php:55

ERRORS!
Tests:

[Killed] FalseValue
Livewire/ResetPassword.php:71:9
             ->filter(fn (string $token) => $this->hasher->check($token, $this->token))
             ->isNotEmpty();
 
-        if ($hasMatching === false) {
+        if ($hasMatching === true) {
             $this->flux->toast(
                 text: 'Password reset expired. Please request a new one.',
killedBy: XbNz\LaravelAuditableUsers\Tests\Feature\Livewire\ResetPasswordTest::it_resets_a_password_if_the_token_is_valid
statusReason: 1) XbNz\LaravelAuditableUsers\Tests\Feature\Livewire\ResetPasswordTest::it_resets_a_password_if_the_token_is_valid
Illuminate\Support\ItemNotFoundException: 

/Users/ag/Documents/Projects/laravel-auditable-users/vendor/laravel/framework/src/Illuminate/Collections/Collection.php:1403
/Users/ag/Documents/Projects/laravel-auditable-users/tests/Feature/Livewire/ResetPasswordTest.php:55

ERRORS!
Tests:

[Survived] MethodCallRemoval
Livewire/ResetPassword.php:72:13
             ->isNotEmpty();
 
         if ($hasMatching === false) {
-            $this->flux->toast(
-                text: 'Password reset expired. Please request a new one.',
-                duration: CarbonInterval::seconds(5)->totalMilliseconds,
-                variant: 'danger'
-            );
+            
 
             $this->redirectAction(ForgotPassword::class, navigate: true);

[Survived] DecrementInteger
Livewire/ResetPassword.php:74:17
         if ($hasMatching === false) {
             $this->flux->toast(
                 text: 'Password reset expired. Please request a new one.',
-                duration: CarbonInterval::seconds(5)->totalMilliseconds,
+                $this->flux->toast(text: 'Password reset expired. Please request a new one.', duration: CarbonInterval::seconds(4)->totalMilliseconds, variant: 'danger');
                 variant: 'danger'
             );

[Survived] IncrementInteger
Livewire/ResetPassword.php:74:17
         if ($hasMatching === false) {
             $this->flux->toast(
                 text: 'Password reset expired. Please request a new one.',
-                duration: CarbonInterval::seconds(5)->totalMilliseconds,
+                $this->flux->toast(text: 'Password reset expired. Please request a new one.', duration: CarbonInterval::seconds(6)->totalMilliseconds, variant: 'danger');
                 variant: 'danger'
             );

[Survived] TrueValue
Livewire/ResetPassword.php:78:13
                 variant: 'danger'
             );
 
-            $this->redirectAction(ForgotPassword::class, navigate: true);
+            $this->redirectAction(ForgotPassword::class, navigate: false);
 
             return;

[Survived] MethodCallRemoval
Livewire/ResetPassword.php:78:13
                 variant: 'danger'
             );
 
-            $this->redirectAction(ForgotPassword::class, navigate: true);
+            
 
             return;

[Killed] MethodCallRemoval
Livewire/ResetPassword.php:83:9
             return;
         }
 
-        $this->pipeline
-            ->pipe($this->hashPassword)
-            ->pipe($this->dispatchCommand)
-            ->process(new Transporter(
-                Uuid::fromString($this->userUuid),
-                $this->newPassword,
-            ));
+        
 
         $this->flux->toast(
killedBy: XbNz\LaravelAuditableUsers\Tests\Feature\Livewire\ResetPasswordTest::it_resets_a_password_if_the_token_is_valid
statusReason: 1) XbNz\LaravelAuditableUsers\Tests\Feature\Livewire\ResetPasswordTest::it_resets_a_password_if_the_token_is_valid
Illuminate\Support\ItemNotFoundException: 

/Users/ag/Documents/Projects/laravel-auditable-users/vendor/laravel/framework/src/Illuminate/Collections/Collection.php:1403
/Users/ag/Documents/Projects/laravel-auditable-users/tests/Feature/Livewire/ResetPasswordTest.php:55

ERRORS!
Tests:

[Survived] MethodCallRemoval
Livewire/ResetPassword.php:91:9
                 $this->newPassword,
             ));
 
-        $this->flux->toast(
-            text: 'Password has been reset.',
-            duration: CarbonInterval::seconds(5)->totalMilliseconds,
-            variant: 'success'
-        );
+        
 
         $this->redirectAction(Login::class, navigate: true);

[Survived] DecrementInteger
Livewire/ResetPassword.php:93:13
 
         $this->flux->toast(
             text: 'Password has been reset.',
-            duration: CarbonInterval::seconds(5)->totalMilliseconds,
+            $this->flux->toast(text: 'Password has been reset.', duration: CarbonInterval::seconds(4)->totalMilliseconds, variant: 'success');
             variant: 'success'
         );

[Survived] IncrementInteger
Livewire/ResetPassword.php:93:13
 
         $this->flux->toast(
             text: 'Password has been reset.',
-            duration: CarbonInterval::seconds(5)->totalMilliseconds,
+            $this->flux->toast(text: 'Password has been reset.', duration: CarbonInterval::seconds(6)->totalMilliseconds, variant: 'success');
             variant: 'success'
         );

[Survived] MethodCallRemoval
Livewire/ResetPassword.php:97:9
             variant: 'success'
         );
 
-        $this->redirectAction(Login::class, navigate: true);
+        
     }
 

[Survived] TrueValue
Livewire/ResetPassword.php:97:9
             variant: 'success'
         );
 
-        $this->redirectAction(Login::class, navigate: true);
+        $this->redirectAction(Login::class, navigate: false);
     }
 
