[Killed] FalseValue
Normalizers/RamseyUuidNormalizer.php:18:9
 {
     public function denormalize(mixed $data, string $type, ?string $format = null, array $context = []): mixed
     {
-        if (is_string($data) === false) {
+        if (is_string($data) === true) {
             throw NotNormalizableValueException::createForUnexpectedDataType('The data should be a string', $data, ['string']);
         }
killedBy: XbNz\LaravelAuditableUsers\Tests\Feature\Reactors\PasswordResetReactorTest::it_clears_reset_tokens
statusReason: 1) XbNz\LaravelAuditableUsers\Tests\Feature\Reactors\PasswordResetReactorTest::it_clears_reset_tokens
Spatie\EventSourcing\StoredEvents\Exceptions\InvalidStoredEvent: Failed to unserialize an event with class `XbNz\LaravelAuditableUsers\StoredEvents\UserResetTokensCleared` on stored event with id `1`. Are you sure that event class exists? 

/Users/ag/Documents/Projects/laravel-auditable-users/vend

[Killed] Identical
Normalizers/RamseyUuidNormalizer.php:18:9
 {
     public function denormalize(mixed $data, string $type, ?string $format = null, array $context = []): mixed
     {
-        if (is_string($data) === false) {
+        if (is_string($data) !== false) {
             throw NotNormalizableValueException::createForUnexpectedDataType('The data should be a string', $data, ['string']);
         }
killedBy: XbNz\LaravelAuditableUsers\Tests\Feature\Reactors\PasswordResetReactorTest::it_clears_reset_tokens
statusReason: 1) XbNz\LaravelAuditableUsers\Tests\Feature\Reactors\PasswordResetReactorTest::it_clears_reset_tokens
Spatie\EventSourcing\StoredEvents\Exceptions\InvalidStoredEvent: Failed to unserialize an event with class `XbNz\LaravelAuditableUsers\StoredEvents\UserResetTokensCleared` on stored event with id `1`. Are you sure that event class exists? 

/Users/ag/Documents/Projects/laravel-auditable-users/vend

[NoCoverage] Throw_
Normalizers/RamseyUuidNormalizer.php:19:13
     public function denormalize(mixed $data, string $type, ?string $format = null, array $context = []): mixed
     {
         if (is_string($data) === false) {
-            throw NotNormalizableValueException::createForUnexpectedDataType('The data should be a string', $data, ['string']);
+            NotNormalizableValueException::createForUnexpectedDataType('The data should be a string', $data, ['string']);
         }
 

[Killed] LogicalAnd
Normalizers/RamseyUuidNormalizer.php:31:9
         ?string $format = null,
         array $context = []
     ): bool {
-        return is_string($data) && is_a($type, UuidInterface::class, true) && Uuid::isValid($data);
+        return is_string($data) && is_a($type, UuidInterface::class, true) || Uuid::isValid($data);
     }
 
killedBy: XbNz\LaravelAuditableUsers\Tests\Feature\Reactors\PasswordResetReactorTest::it_clears_reset_tokens
statusReason: 1) XbNz\LaravelAuditableUsers\Tests\Feature\Reactors\PasswordResetReactorTest::it_clears_reset_tokens
TypeError: Ramsey\Uuid\Uuid::isValid(): Argument #1 ($uuid) must be of type string, null given, called in /Users/ag/Documents/Projects/laravel-auditable-users/src/Normalizers/RamseyUuidNormalizer.php on line 23

/Users/ag/Documents/Projects/laravel-auditable-users/vendor/ramsey/uuid/src/Uuid.php:5

[Killed] LogicalAndSingleSubExprNegation
Normalizers/RamseyUuidNormalizer.php:31:9
         ?string $format = null,
         array $context = []
     ): bool {
-        return is_string($data) && is_a($type, UuidInterface::class, true) && Uuid::isValid($data);
+        return is_string($data) && is_a($type, UuidInterface::class, true) && !Uuid::isValid($data);
     }
 
killedBy: XbNz\LaravelAuditableUsers\Tests\Feature\Reactors\PasswordResetReactorTest::it_clears_reset_tokens
statusReason: 1) XbNz\LaravelAuditableUsers\Tests\Feature\Reactors\PasswordResetReactorTest::it_clears_reset_tokens
Spatie\EventSourcing\StoredEvents\Exceptions\InvalidStoredEvent: Failed to unserialize an event with class `XbNz\LaravelAuditableUsers\StoredEvents\UserResetTokensCleared` on stored event with id `1`. Are you sure that event class exists? 

/Users/ag/Documents/Projects/laravel-auditable-users/vend

[Killed] InstanceOf_
Normalizers/RamseyUuidNormalizer.php:46:9
 
     public function supportsNormalization(mixed $data, ?string $format = null, array $context = []): bool
     {
-        return $data instanceof UuidInterface;
+        return false;
     }
 
killedBy: XbNz\LaravelAuditableUsers\Tests\Feature\Projectors\UserProjector\OnUserRegisteredTest::user_registered
statusReason: 1) XbNz\LaravelAuditableUsers\Tests\Feature\Projectors\UserProjector\OnUserRegisteredTest::user_registered
Ramsey\Uuid\Exception\UnsupportedOperationException: Not a time-based UUID

/Users/ag/Documents/Projects/laravel-auditable-users/vendor/ramsey/uuid/src/DeprecatedUuidMethodsTrait.php:333
/Users/ag/Documents/Projects/laravel-auditable-users/vendor/ramsey/uuid/src/Lazy/LazyUuidFromString.php:22

[Survived] InstanceOf_
Normalizers/RamseyUuidNormalizer.php:46:9
 
     public function supportsNormalization(mixed $data, ?string $format = null, array $context = []): bool
     {
-        return $data instanceof UuidInterface;
+        return true;
     }
 

[Survived] TrueValue
Normalizers/RamseyUuidNormalizer.php:52:13
     public function getSupportedTypes(?string $format): array
     {
         return [
-            UuidInterface::class => true,
+            return [UuidInterface::class => false];
         ];
     }
