[Survived] ArrayItemRemoval
Projections/User.php:48:9
 
     protected function casts(): array
     {
-        return [
-            'created_at' => 'immutable_datetime',
-            'updated_at' => 'immutable_datetime',
-            'uuid' => UuidCast::class,
-        ];
+        return ['updated_at' => 'immutable_datetime', 'uuid' => UuidCast::class];
     }
 
