[Killed] MethodCallRemoval
Projectors/UserProjector.php:29:9
     {
         Assert::notNull($event->createdAt());
 
-        new User()->writeable()->create([
-            'uuid' => $event->userUuid,
-            'email' => $event->email,
-            'password' => $event->hashedPassword,
-            'created_at' => $event->createdAt()->toImmutable(),
-        ]);
+        
     }
 
killedBy: XbNz\LaravelAuditableUsers\Tests\Feature\Projectors\UserProjector\OnUserRegisteredTest::user_registered
statusReason: 1) XbNz\LaravelAuditableUsers\Tests\Feature\Projectors\UserProjector\OnUserRegisteredTest::user_registered
Failed asserting that a row in the table [users] matches the attributes {
    "uuid": "0195c1c8-aa6a-7260-a5a9-b2954d37602e",
    "email": "hello@auditable-users.com",
    "password": "123456"
}.

The table is empty.

[Killed] MethodCallRemoval
Projectors/UserProjector.php:41:9
     {
         Assert::notNull($event->createdAt());
         
-        User::query()->findOrFail($event->userUuid)
-            ->writeable()
-            ->update([
-                'email_verified_at' => $event->createdAt()->format('Y-m-d H:i:s'),
-            ]);
+        
     }
 
killedBy: XbNz\LaravelAuditableUsers\Tests\Feature\Projectors\UserProjector\OnUserConfirmedTest::user_confirmed
statusReason: 1) XbNz\LaravelAuditableUsers\Tests\Feature\Projectors\UserProjector\OnUserConfirmedTest::user_confirmed
Failed asserting that a row in the table [users] matches the attributes {
    "uuid": "0195c1c8-af07-719d-8e3c-6dce12d38828",
    "email": "wilfredo55@example.com",
    "email_verified_at": "2025-03-23 06:55:09"
}.

Found similar results: [

[Killed] MethodCallRemoval
Projectors/UserProjector.php:50:9
 
     public function onUserResetTokenCreated(UserResetTokenCreated $event): void
     {
-        $this->passwordResetTokenRepository->create(
-            $event->userUuid,
-            $event->plainTextToken,
-        );
+        
     }
 
killedBy: XbNz\LaravelAuditableUsers\Tests\Feature\Projectors\UserProjector\OnUserResetTokenCreatedTest::user_reset_token_created
statusReason: 1) XbNz\LaravelAuditableUsers\Tests\Feature\Projectors\UserProjector\OnUserResetTokenCreatedTest::user_reset_token_created
Illuminate\Support\ItemNotFoundException: 

/Users/ag/Documents/Projects/laravel-auditable-users/vendor/laravel/framework/src/Illuminate/Collections/Collection.php:1403
/Users/ag/Documents/Projects/laravel-auditable-users/tests/Feature/Projectors/UserProjector/OnUserResetToken

[Killed] MethodCallRemoval
Projectors/UserProjector.php:58:9
 
     public function onUserPasswordReset(UserPasswordReset $event): void
     {
-        User::query()->findOrFail($event->userUuid)
-            ->writeable()
-            ->update([
-                'password' => $event->hashedNewPassword,
-            ]);
+        
     }
 
killedBy: XbNz\LaravelAuditableUsers\Tests\Feature\Projectors\UserProjector\OnUserPasswordResetTest::user_password_is_reset
statusReason: 1) XbNz\LaravelAuditableUsers\Tests\Feature\Projectors\UserProjector\OnUserPasswordResetTest::user_password_is_reset
Failed asserting that a row in the table [users] matches the attributes {
    "uuid": "0195c1c8-b4a5-7021-976d-91b4da7079b4",
    "password": "p2ieH`^0\\*GltTA&z!g"
}.

Found similar results: [
    {

[Killed] MethodCallRemoval
Projectors/UserProjector.php:67:9
 
     public function onUserResetTokensCleared(UserResetTokensCleared $event): void
     {
-        $this->passwordResetTokenRepository->deleteAll($event->userUuid);
+        
     }
 
killedBy: XbNz\LaravelAuditableUsers\Tests\Feature\Projectors\UserProjector\OnUserResetTokensClearedTest::user_reset_tokens_are_cleared
statusReason: 1) XbNz\LaravelAuditableUsers\Tests\Feature\Projectors\UserProjector\OnUserResetTokensClearedTest::user_reset_tokens_are_cleared
Failed asserting that an object is empty.

/Users/ag/Documents/Projects/laravel-auditable-users/tests/Feature/Projectors/UserProjector/OnUserResetTokensClearedTest.php:56

FAILURES!
Tests: 1, Assertions: 1, Failures: 1.

[Killed] MethodCallRemoval
Projectors/UserProjector.php:72:9
 
     public function onUserPostLoginDataCreated(UserPostLoginDataCreated $event): void
     {
-        User::query()->findOrFail($event->userUuid)
-            ->writeable()
-            ->update([
-                'remember_token' => $event->rememberToken,
-            ]);
+        
     }
 }
killedBy: XbNz\LaravelAuditableUsers\Tests\Feature\Projectors\UserProjector\OnUserPostLoginDataCreatedTest::user_post_login_data_created
statusReason: 1) XbNz\LaravelAuditableUsers\Tests\Feature\Projectors\UserProjector\OnUserPostLoginDataCreatedTest::user_post_login_data_created
Failed asserting that a row in the table [users] matches the attributes {
    "uuid": "0195c1c8-ba4a-723a-a809-6211ab0a0e76",
    "remember_token": "b212cabbfec8078639f316a19b52ee01fe87d24ae85b1a1735a89d79ab078d70"
}.

Found similar results: [
    {
