[Survived] MethodCallRemoval
Providers/AuditableUsersServiceProvider.php:31:9
 {
     public function register(): void
     {
-        $this->app->singleton(RedisPasswordResetTokenRepository::class, function (Application $foundation) {
-            $redis = $foundation->make(RedisManager::class)
-                ->connection('default')
-                ->client();
-
-            return new RedisPasswordResetTokenRepository($redis);
-        });
+        
 
         $this->app->singleton(PasswordResetTokenRepository::class, RedisPasswordResetTokenRepository::class);

[Killed] NewObject
Providers/AuditableUsersServiceProvider.php:36:13
                 ->connection('default')
                 ->client();
 
-            return new RedisPasswordResetTokenRepository($redis);
+            new RedisPasswordResetTokenRepository($redis);
+            return null;
         });
 
killedBy: XbNz\LaravelAuditableUsers\Tests\Feature\AggregateRoots\UserAggregateRoot\ConfirmTest::it_confirms_a_user
statusReason: 1) XbNz\LaravelAuditableUsers\Tests\Feature\AggregateRoots\UserAggregateRoot\ConfirmTest::it_confirms_a_user
TypeError: XbNz\LaravelAuditableUsers\Projectors\UserProjector::__construct(): Argument #1 ($passwordResetTokenRepository) must be of type XbNz\LaravelAuditableUsers\Contracts\PasswordResetTokenRepository, null given

/Users/ag/Documents/Projects/laravel-auditable-users/src/Projectors/UserP

[Killed] MethodCallRemoval
Providers/AuditableUsersServiceProvider.php:39:9
             return new RedisPasswordResetTokenRepository($redis);
         });
 
-        $this->app->singleton(PasswordResetTokenRepository::class, RedisPasswordResetTokenRepository::class);
+        
 
         $this->mergeConfigFrom(__DIR__.'/../../config/config.php', 'auditable-users');
killedBy: XbNz\LaravelAuditableUsers\Tests\Feature\AggregateRoots\UserAggregateRoot\ConfirmTest::it_confirms_a_user
statusReason: 1) XbNz\LaravelAuditableUsers\Tests\Feature\AggregateRoots\UserAggregateRoot\ConfirmTest::it_confirms_a_user
Illuminate\Contracts\Container\BindingResolutionException: Target [XbNz\LaravelAuditableUsers\Contracts\PasswordResetTokenRepository] is not instantiable while building [XbNz\LaravelAuditableUsers\Providers\AuditableUsersServiceProvider, XbNz\LaravelAuditableUsers\Projectors\UserProjector].

[Killed] ConcatOperandRemoval
Providers/AuditableUsersServiceProvider.php:41:9
 
         $this->app->singleton(PasswordResetTokenRepository::class, RedisPasswordResetTokenRepository::class);
 
-        $this->mergeConfigFrom(__DIR__.'/../../config/config.php', 'auditable-users');
+        $this->mergeConfigFrom(__DIR__, 'auditable-users');
     }
 
killedBy: XbNz\LaravelAuditableUsers\Tests\Feature\AggregateRoots\UserAggregateRoot\ConfirmTest::it_confirms_a_user
statusReason: 1) XbNz\LaravelAuditableUsers\Tests\Feature\AggregateRoots\UserAggregateRoot\ConfirmTest::it_confirms_a_user
ErrorException: fread(): Read of 8192 bytes failed with errno=21 Is a directory

/Users/ag/Documents/Projects/laravel-auditable-users/vendor/laravel/framework/src/Illuminate/Foundation/Bootstrap/HandleExceptions.php:256
/Users/ag/Documents/Projects/laravel-auditable-users/vendor/infection/i

[Killed] Concat
Providers/AuditableUsersServiceProvider.php:41:9
 
         $this->app->singleton(PasswordResetTokenRepository::class, RedisPasswordResetTokenRepository::class);
 
-        $this->mergeConfigFrom(__DIR__.'/../../config/config.php', 'auditable-users');
+        $this->mergeConfigFrom('/../../config/config.php' . __DIR__, 'auditable-users');
     }
 
killedBy: XbNz\LaravelAuditableUsers\Tests\Feature\AggregateRoots\UserAggregateRoot\ConfirmTest::it_confirms_a_user
statusReason: 1) XbNz\LaravelAuditableUsers\Tests\Feature\AggregateRoots\UserAggregateRoot\ConfirmTest::it_confirms_a_user
ErrorException: fopen(/../../config/config.php/Users/ag/Documents/Projects/laravel-auditable-users/src/Providers): Failed to open stream: No such file or directory

/Users/ag/Documents/Projects/laravel-auditable-users/vendor/laravel/framework/src/Illuminate/Foundation/Bootstrap/HandleExcept

[Killed] MethodCallRemoval
Providers/AuditableUsersServiceProvider.php:46:9
 
     public function boot(): void
     {
-        $this->app->make(Projectionist::class)
-            ->addProjectors([
-                UserProjector::class,
-            ])
-            ->addReactors([
-                EmailConfirmationReactor::class,
-                PasswordResetEmailReactor::class,
-                PasswordResetReactor::class,
-            ]);
+        
 
         Livewire::component('auditable-users::login', Login::class);
killedBy: XbNz\LaravelAuditableUsers\Tests\Feature\Reactors\EmailConfirmationReactorTest::reactor_is_registered
statusReason: 1) XbNz\LaravelAuditableUsers\Tests\Feature\Reactors\EmailConfirmationReactorTest::reactor_is_registered
Illuminate\Support\ItemNotFoundException: 

/Users/ag/Documents/Projects/laravel-auditable-users/vendor/laravel/framework/src/Illuminate/Collections/Collection.php:1403
/Users/ag/Documents/Projects/laravel-auditable-users/tests/Feature/Reactors/EmailConfirmationReactorTest.php:64

ERRORS!
Tests

[Killed] ArrayItemRemoval
Providers/AuditableUsersServiceProvider.php:47:13
     public function boot(): void
     {
         $this->app->make(Projectionist::class)
-            ->addProjectors([
-                UserProjector::class,
-            ])
+            $this->app->make(Projectionist::class)->addProjectors([])->addReactors([EmailConfirmationReactor::class, PasswordResetEmailReactor::class, PasswordResetReactor::class]);
             ->addReactors([
                 EmailConfirmationReactor::class,
killedBy: XbNz\LaravelAuditableUsers\Tests\Feature\Livewire\EmailVerifiedTest::it_confirms_an_email
statusReason: 1) XbNz\LaravelAuditableUsers\Tests\Feature\Livewire\EmailVerifiedTest::it_confirms_an_email
Illuminate\Database\Eloquent\ModelNotFoundException: No query results for model [XbNz\LaravelAuditableUsers\Projections\User] 0195c1c8-e644-721a-90a4-f7e8f99beb41

/Users/ag/Documents/Projects/laravel-auditable-users/vendor/laravel/framework/src/Illuminate/Database/Eloquent/Builder.php:539
/Users/ag/Docume

[Killed] ArrayItemRemoval
Providers/AuditableUsersServiceProvider.php:50:13
             ->addProjectors([
                 UserProjector::class,
             ])
-            ->addReactors([
-                EmailConfirmationReactor::class,
-                PasswordResetEmailReactor::class,
-                PasswordResetReactor::class,
-            ]);
+            $this->app->make(Projectionist::class)->addProjectors([UserProjector::class])->addReactors([PasswordResetEmailReactor::class, PasswordResetReactor::class]);
 
         Livewire::component('auditable-users::login', Login::class);
killedBy: XbNz\LaravelAuditableUsers\Tests\Feature\Reactors\EmailConfirmationReactorTest::reactor_is_registered
statusReason: 1) XbNz\LaravelAuditableUsers\Tests\Feature\Reactors\EmailConfirmationReactorTest::reactor_is_registered
Illuminate\Support\ItemNotFoundException: 

/Users/ag/Documents/Projects/laravel-auditable-users/vendor/laravel/framework/src/Illuminate/Collections/Collection.php:1403
/Users/ag/Documents/Projects/laravel-auditable-users/tests/Feature/Reactors/EmailConfirmationReactorTest.php:64

ERRORS!
Tests

[Survived] MethodCallRemoval
Providers/AuditableUsersServiceProvider.php:56:9
                 PasswordResetReactor::class,
             ]);
 
-        Livewire::component('auditable-users::login', Login::class);
+        
         Livewire::component('auditable-users::register', Register::class);
         Livewire::component('auditable-users::forgot-password', ForgotPassword::class);

[Survived] MethodCallRemoval
Providers/AuditableUsersServiceProvider.php:57:9
             ]);
 
         Livewire::component('auditable-users::login', Login::class);
-        Livewire::component('auditable-users::register', Register::class);
+        
         Livewire::component('auditable-users::forgot-password', ForgotPassword::class);
         Livewire::component('auditable-users::reset-password', ResetPassword::class);

[Survived] MethodCallRemoval
Providers/AuditableUsersServiceProvider.php:58:9
 
         Livewire::component('auditable-users::login', Login::class);
         Livewire::component('auditable-users::register', Register::class);
-        Livewire::component('auditable-users::forgot-password', ForgotPassword::class);
+        
         Livewire::component('auditable-users::reset-password', ResetPassword::class);
         Livewire::component('auditable-users::email-verified', EmailVerified::class);

[Survived] MethodCallRemoval
Providers/AuditableUsersServiceProvider.php:59:9
         Livewire::component('auditable-users::login', Login::class);
         Livewire::component('auditable-users::register', Register::class);
         Livewire::component('auditable-users::forgot-password', ForgotPassword::class);
-        Livewire::component('auditable-users::reset-password', ResetPassword::class);
+        
         Livewire::component('auditable-users::email-verified', EmailVerified::class);
 

[Survived] MethodCallRemoval
Providers/AuditableUsersServiceProvider.php:60:9
         Livewire::component('auditable-users::register', Register::class);
         Livewire::component('auditable-users::forgot-password', ForgotPassword::class);
         Livewire::component('auditable-users::reset-password', ResetPassword::class);
-        Livewire::component('auditable-users::email-verified', EmailVerified::class);
+        
 
         $this->loadViewsFrom(__DIR__.'/../../resources/views', 'auditable-users');

[Killed] Concat
Providers/AuditableUsersServiceProvider.php:62:9
         Livewire::component('auditable-users::reset-password', ResetPassword::class);
         Livewire::component('auditable-users::email-verified', EmailVerified::class);
 
-        $this->loadViewsFrom(__DIR__.'/../../resources/views', 'auditable-users');
+        $this->loadViewsFrom('/../../resources/views' . __DIR__, 'auditable-users');
         $this->registerRoutes();
 
killedBy: XbNz\LaravelAuditableUsers\Tests\Feature\Livewire\EmailVerifiedTest::it_confirms_an_email
statusReason: 1) XbNz\LaravelAuditableUsers\Tests\Feature\Livewire\EmailVerifiedTest::it_confirms_an_email
InvalidArgumentException: View [emails.confirmation] not found.

/Users/ag/Documents/Projects/laravel-auditable-users/vendor/laravel/framework/src/Illuminate/View/FileViewFinder.php:139
/Users/ag/Documents/Projects/laravel-auditable-users/vendor/laravel/framework/src/Illuminate/View/FileViewFinder.php:92
/

[Killed] MethodCallRemoval
Providers/AuditableUsersServiceProvider.php:62:9
         Livewire::component('auditable-users::reset-password', ResetPassword::class);
         Livewire::component('auditable-users::email-verified', EmailVerified::class);
 
-        $this->loadViewsFrom(__DIR__.'/../../resources/views', 'auditable-users');
+        
         $this->registerRoutes();
 
killedBy: XbNz\LaravelAuditableUsers\Tests\Feature\Livewire\EmailVerifiedTest::it_confirms_an_email
statusReason: 1) XbNz\LaravelAuditableUsers\Tests\Feature\Livewire\EmailVerifiedTest::it_confirms_an_email
InvalidArgumentException: No hint path defined for [auditable-users].

/Users/ag/Documents/Projects/laravel-auditable-users/vendor/laravel/framework/src/Illuminate/View/FileViewFinder.php:112
/Users/ag/Documents/Projects/laravel-auditable-users/vendor/laravel/framework/src/Illuminate/View/FileViewFinder.ph

[Killed] MethodCallRemoval
Providers/AuditableUsersServiceProvider.php:63:9
         Livewire::component('auditable-users::email-verified', EmailVerified::class);
 
         $this->loadViewsFrom(__DIR__.'/../../resources/views', 'auditable-users');
-        $this->registerRoutes();
+        
 
         if ($this->app->runningInConsole() === true) {
killedBy: XbNz\LaravelAuditableUsers\Tests\Feature\Reactors\EmailConfirmationReactorTest::it_dispatches_an_email_with_the_correct_signed_url
statusReason: 1) XbNz\LaravelAuditableUsers\Tests\Feature\Reactors\EmailConfirmationReactorTest::it_dispatches_an_email_with_the_correct_signed_url
Symfony\Component\Routing\Exception\RouteNotFoundException: Route [confirmEmail] not defined.

/Users/ag/Documents/Projects/laravel-auditable-users/vendor/laravel/framework/src/Illuminate/Routing/UrlGenerator.php:527
/Users/ag/Documents/Projects/laravel-auditable-us

[Survived] Identical
Providers/AuditableUsersServiceProvider.php:65:9
         $this->loadViewsFrom(__DIR__.'/../../resources/views', 'auditable-users');
         $this->registerRoutes();
 
-        if ($this->app->runningInConsole() === true) {
+        if ($this->app->runningInConsole() !== true) {
             $this->loadMigrationsFrom(__DIR__.'/../../database/migrations');
 

[Survived] TrueValue
Providers/AuditableUsersServiceProvider.php:65:9
         $this->loadViewsFrom(__DIR__.'/../../resources/views', 'auditable-users');
         $this->registerRoutes();
 
-        if ($this->app->runningInConsole() === true) {
+        if ($this->app->runningInConsole() === false) {
             $this->loadMigrationsFrom(__DIR__.'/../../database/migrations');
 

[Survived] Concat
Providers/AuditableUsersServiceProvider.php:66:13
         $this->registerRoutes();
 
         if ($this->app->runningInConsole() === true) {
-            $this->loadMigrationsFrom(__DIR__.'/../../database/migrations');
+            $this->loadMigrationsFrom('/../../database/migrations' . __DIR__);
 
             $this->publishes([

[Survived] ConcatOperandRemoval
Providers/AuditableUsersServiceProvider.php:66:13
         $this->registerRoutes();
 
         if ($this->app->runningInConsole() === true) {
-            $this->loadMigrationsFrom(__DIR__.'/../../database/migrations');
+            $this->loadMigrationsFrom(__DIR__);
 
             $this->publishes([

[Survived] MethodCallRemoval
Providers/AuditableUsersServiceProvider.php:68:13
         if ($this->app->runningInConsole() === true) {
             $this->loadMigrationsFrom(__DIR__.'/../../database/migrations');
 
-            $this->publishes([
-                __DIR__.'/../../config/config.php' => config_path('auditable-users.php'),
-            ], 'auditable-users-config');
+            
 
             $this->publishes([

[Survived] ArrayItemRemoval
Providers/AuditableUsersServiceProvider.php:68:13
         if ($this->app->runningInConsole() === true) {
             $this->loadMigrationsFrom(__DIR__.'/../../database/migrations');
 
-            $this->publishes([
-                __DIR__.'/../../config/config.php' => config_path('auditable-users.php'),
-            ], 'auditable-users-config');
+            $this->publishes([], 'auditable-users-config');s-config');
 
             $this->publishes([

[Survived] ConcatOperandRemoval
Providers/AuditableUsersServiceProvider.php:69:17
             $this->loadMigrationsFrom(__DIR__.'/../../database/migrations');
 
             $this->publishes([
-                __DIR__.'/../../config/config.php' => config_path('auditable-users.php'),
+                $this->publishes(['/../../config/config.php' => config_path('auditable-users.php')], 'auditable-users-config');
             ], 'auditable-users-config');
 

[Survived] Concat
Providers/AuditableUsersServiceProvider.php:69:17
             $this->loadMigrationsFrom(__DIR__.'/../../database/migrations');
 
             $this->publishes([
-                __DIR__.'/../../config/config.php' => config_path('auditable-users.php'),
+                $this->publishes(['/../../config/config.php' . __DIR__ => config_path('auditable-users.php')], 'auditable-users-config');
             ], 'auditable-users-config');
 

[Survived] MethodCallRemoval
Providers/AuditableUsersServiceProvider.php:72:13
                 __DIR__.'/../../config/config.php' => config_path('auditable-users.php'),
             ], 'auditable-users-config');
 
-            $this->publishes([
-                __DIR__.'/../../resources/views' => resource_path('views/vendor/auditable-users'),
-            ], 'auditable-users-views');
+            
 
             $this->publishes([

[Survived] ConcatOperandRemoval
Providers/AuditableUsersServiceProvider.php:73:17
             ], 'auditable-users-config');
 
             $this->publishes([
-                __DIR__.'/../../resources/views' => resource_path('views/vendor/auditable-users'),
+                $this->publishes([__DIR__ => resource_path('views/vendor/auditable-users')], 'auditable-users-views');
             ], 'auditable-users-views');
 

[Survived] Concat
Providers/AuditableUsersServiceProvider.php:73:17
             ], 'auditable-users-config');
 
             $this->publishes([
-                __DIR__.'/../../resources/views' => resource_path('views/vendor/auditable-users'),
+                $this->publishes(['/../../resources/views' . __DIR__ => resource_path('views/vendor/auditable-users')], 'auditable-users-views');
             ], 'auditable-users-views');
 

[Survived] MethodCallRemoval
Providers/AuditableUsersServiceProvider.php:76:13
                 __DIR__.'/../../resources/views' => resource_path('views/vendor/auditable-users'),
             ], 'auditable-users-views');
 
-            $this->publishes([
-                __DIR__.'/../../database/migrations' => database_path('migrations'),
-            ], 'event-sourcing-migrations');
+            
         }
 

[Survived] ConcatOperandRemoval
Providers/AuditableUsersServiceProvider.php:77:17
             ], 'auditable-users-views');
 
             $this->publishes([
-                __DIR__.'/../../database/migrations' => database_path('migrations'),
+                $this->publishes([__DIR__ => database_path('migrations')], 'event-sourcing-migrations');
             ], 'event-sourcing-migrations');
         }

[Survived] Concat
Providers/AuditableUsersServiceProvider.php:77:17
             ], 'auditable-users-views');
 
             $this->publishes([
-                __DIR__.'/../../database/migrations' => database_path('migrations'),
+                $this->publishes(['/../../database/migrations' . __DIR__ => database_path('migrations')], 'event-sourcing-migrations');
             ], 'event-sourcing-migrations');
         }

[Killed] MethodCallRemoval
Providers/AuditableUsersServiceProvider.php:81:9
             ], 'event-sourcing-migrations');
         }
 
-        $this->app->make(Repository::class)->set(
-            'event-sourcing.event_normalizers',
-            array_merge(
-                [
-                    RamseyUuidNormalizer::class,
-                ],
-                $this->app->make(Repository::class)->get('event-sourcing.event_normalizers'),
-            )
-        );
+        
     }
 
killedBy: XbNz\LaravelAuditableUsers\Tests\Feature\Projectors\UserProjector\OnUserConfirmedTest::user_confirmed
statusReason: 1) XbNz\LaravelAuditableUsers\Tests\Feature\Projectors\UserProjector\OnUserConfirmedTest::user_confirmed
Ramsey\Uuid\Exception\UnsupportedOperationException: Not a time-based UUID

/Users/ag/Documents/Projects/laravel-auditable-users/vendor/ramsey/uuid/src/DeprecatedUuidMethodsTrait.php:333
/Users/ag/Documents/Projects/laravel-auditable-users/vendor/ramsey/uuid/src/Lazy/LazyUuidFromString.php:222

[Killed] MethodCallRemoval
Providers/AuditableUsersServiceProvider.php:94:9
 
     private function registerRoutes(): void
     {
-        $this->app->make(Router::class)
-            ->group(
-                [
-                    'middleware' => 'web',
-                ],
-                fn () => $this->loadRoutesFrom(__DIR__.'/../../routes/web.php')
-            );
+        
     }
 }
killedBy: XbNz\LaravelAuditableUsers\Tests\Feature\Reactors\EmailConfirmationReactorTest::it_dispatches_an_email_with_the_correct_signed_url
statusReason: 1) XbNz\LaravelAuditableUsers\Tests\Feature\Reactors\EmailConfirmationReactorTest::it_dispatches_an_email_with_the_correct_signed_url
Symfony\Component\Routing\Exception\RouteNotFoundException: Route [confirmEmail] not defined.

/Users/ag/Documents/Projects/laravel-auditable-users/vendor/laravel/framework/src/Illuminate/Routing/UrlGenerator.php:527
/Users/ag/Documents/Projects/laravel-auditable-us

[Survived] ArrayItemRemoval
Providers/AuditableUsersServiceProvider.php:96:17
     {
         $this->app->make(Router::class)
             ->group(
-                [
-                    'middleware' => 'web',
-                ],
+                $this->app->make(Router::class)->group([], fn() => $this->loadRoutesFrom(__DIR__ . '/../../routes/web.php'));,
                 fn () => $this->loadRoutesFrom(__DIR__.'/../../routes/web.php')
             );

[Killed] Concat
Providers/AuditableUsersServiceProvider.php:99:17
                 [
                     'middleware' => 'web',
                 ],
-                fn () => $this->loadRoutesFrom(__DIR__.'/../../routes/web.php')
+                $this->app->make(Router::class)->group(['middleware' => 'web'], fn() => $this->loadRoutesFrom('/../../routes/web.php' . __DIR__));
             );
     }
killedBy: XbNz\LaravelAuditableUsers\Tests\Feature\AggregateRoots\UserAggregateRoot\ConfirmTest::it_confirms_a_user
statusReason: 1) XbNz\LaravelAuditableUsers\Tests\Feature\AggregateRoots\UserAggregateRoot\ConfirmTest::it_confirms_a_user
ErrorException: fopen(/../../routes/web.php/Users/ag/Documents/Projects/laravel-auditable-users/src/Providers): Failed to open stream: No such file or directory

/Users/ag/Documents/Projects/laravel-auditable-users/vendor/laravel/framework/src/Illuminate/Foundation/Bootstrap/HandleException

[Killed] ConcatOperandRemoval
Providers/AuditableUsersServiceProvider.php:99:17
                 [
                     'middleware' => 'web',
                 ],
-                fn () => $this->loadRoutesFrom(__DIR__.'/../../routes/web.php')
+                $this->app->make(Router::class)->group(['middleware' => 'web'], fn() => $this->loadRoutesFrom(__DIR__));
             );
     }
killedBy: XbNz\LaravelAuditableUsers\Tests\Feature\AggregateRoots\UserAggregateRoot\ConfirmTest::it_confirms_a_user
statusReason: 1) XbNz\LaravelAuditableUsers\Tests\Feature\AggregateRoots\UserAggregateRoot\ConfirmTest::it_confirms_a_user
ErrorException: fread(): Read of 8192 bytes failed with errno=21 Is a directory

/Users/ag/Documents/Projects/laravel-auditable-users/vendor/laravel/framework/src/Illuminate/Foundation/Bootstrap/HandleExceptions.php:256
/Users/ag/Documents/Projects/laravel-auditable-users/vendor/infection/i
