[Killed] MethodCallRemoval
Reactors/EmailConfirmationReactor.php:25:9
 
     public function onUserRegistered(UserRegistered $event): void
     {
-        $this->pipeline
-            ->pipe($this->generateSignedUrl)
-            ->pipe($this->sendConfirmationEmail)
-            ->process(new Transporter(
-                $event->userUuid,
-                $event->email,
-            ));
+        
     }
 }
killedBy: XbNz\LaravelAuditableUsers\Tests\Feature\Reactors\EmailConfirmationReactorTest::it_dispatches_an_email_with_the_correct_signed_url
statusReason: 1) XbNz\LaravelAuditableUsers\Tests\Feature\Reactors\EmailConfirmationReactorTest::it_dispatches_an_email_with_the_correct_signed_url
The total number of mailables sent was 0 instead of 1.
Failed asserting that 0 is identical to 1.

/Users/ag/Documents/Projects/laravel-auditable-users/vendor/laravel/framework/src/Illuminate/Support/Testing/Fakes/MailFake.php:287
/Users/ag/Documents/Projects/larave
