[Killed] MethodCallRemoval
Reactors/PasswordResetEmailReactor.php:27:9
 
     public function onUserResetEmailSent(UserResetEmailSent $event): void
     {
-        $this->pipeline
-            ->pipe($this->generateResetToken)
-            ->pipe($this->generateSignedUrl)
-            ->pipe($this->sendResetEmail)
-            ->process(new Transporter(
-                $event->userUuid,
-                $event->email,
-            ));
+        
     }
 }
killedBy: XbNz\LaravelAuditableUsers\Tests\Feature\Reactors\PasswordResetEmailReactorTest::it_dispatches_an_email_with_the_correct_signed_url_and_reset_token
statusReason: 1) XbNz\LaravelAuditableUsers\Tests\Feature\Reactors\PasswordResetEmailReactorTest::it_dispatches_an_email_with_the_correct_signed_url_and_reset_token
Illuminate\Support\ItemNotFoundException: 

/Users/ag/Documents/Projects/laravel-auditable-users/vendor/laravel/framework/src/Illuminate/Collections/Collection.php:1403
/Users/ag/Documents/Projects/laravel-auditable-users/tests/Feature/Reactors/Pass
