[Killed] MethodCallRemoval
Reactors/PasswordResetReactor.php:21:9
 
     public function onUserPasswordReset(UserPasswordReset $event): void
     {
-        $this->commandBus->dispatch(new ClearResetTokens(
-            $event->userUuid,
-        ));
+        
     }
 }
killedBy: XbNz\LaravelAuditableUsers\Tests\Feature\Reactors\PasswordResetReactorTest::it_clears_reset_tokens
statusReason: 1) XbNz\LaravelAuditableUsers\Tests\Feature\Reactors\PasswordResetReactorTest::it_clears_reset_tokens
Illuminate\Support\ItemNotFoundException: 

/Users/ag/Documents/Projects/laravel-auditable-users/vendor/laravel/framework/src/Illuminate/Collections/Collection.php:1403
/Users/ag/Documents/Projects/laravel-auditable-users/tests/Feature/Reactors/PasswordResetReactorTest.php:42

ERRORS!
Tests: 1, As
