[Killed] MethodCallRemoval
Repositories/RedisPasswordResetTokenRepository.php:18:9
 
     public function create(UuidInterface $userUuid, string $plainTextToken): void
     {
-        $this->redis->sAdd("password_reset_tokens:{$userUuid->toString()}", $plainTextToken);
+        
     }
 
killedBy: XbNz\LaravelAuditableUsers\Tests\Feature\Projectors\UserProjector\OnUserResetTokenCreatedTest::user_reset_token_created
statusReason: 1) XbNz\LaravelAuditableUsers\Tests\Feature\Projectors\UserProjector\OnUserResetTokenCreatedTest::user_reset_token_created
Illuminate\Support\ItemNotFoundException: 

/Users/ag/Documents/Projects/laravel-auditable-users/vendor/laravel/framework/src/Illuminate/Collections/Collection.php:1403
/Users/ag/Documents/Projects/laravel-auditable-users/tests/Feature/Projectors/UserProjector/OnUserResetToken

[Killed] MethodCallRemoval
Repositories/RedisPasswordResetTokenRepository.php:28:9
 
     public function delete(UuidInterface $userUuid, string $plainTextToken): void
     {
-        $this->redis->sRem("password_reset_tokens:{$userUuid->toString()}", $plainTextToken);
+        
     }
 
killedBy: XbNz\LaravelAuditableUsers\Tests\Feature\Repositories\RedisPasswordResetTokenRepositoryTest::it_deletes_a_reset_token
statusReason: 1) XbNz\LaravelAuditableUsers\Tests\Feature\Repositories\RedisPasswordResetTokenRepositoryTest::it_deletes_a_reset_token
Failed asserting that an object is empty.

/Users/ag/Documents/Projects/laravel-auditable-users/tests/Feature/Repositories/RedisPasswordResetTokenRepositoryTest.php:53

FAILURES!
Tests: 2, Assertions: 3, Failures: 1.

[Killed] MethodCallRemoval
Repositories/RedisPasswordResetTokenRepository.php:33:9
 
     public function deleteAll(UuidInterface $userUuid): void
     {
-        $this->redis->del("password_reset_tokens:{$userUuid->toString()}");
+        
     }
 }
killedBy: XbNz\LaravelAuditableUsers\Tests\Feature\Projectors\UserProjector\OnUserResetTokensClearedTest::user_reset_tokens_are_cleared
statusReason: 1) XbNz\LaravelAuditableUsers\Tests\Feature\Projectors\UserProjector\OnUserResetTokensClearedTest::user_reset_tokens_are_cleared
Failed asserting that an object is empty.

/Users/ag/Documents/Projects/laravel-auditable-users/tests/Feature/Projectors/UserProjector/OnUserResetTokensClearedTest.php:56

FAILURES!
Tests: 1, Assertions: 1, Failures: 1.
