[Killed] MethodCallRemoval
Stages/ConfirmUser/DispatchCommand.php:24:9
     {
         Assert::isInstanceOf($payload, Transporter::class);
 
-        $this->commandBus->dispatch(new Confirm(
-            $payload->userUuid,
-            $payload->email,
-        ));
+        
 
         return $payload;
killedBy: XbNz\LaravelAuditableUsers\Tests\Feature\Livewire\EmailVerifiedTest::it_confirms_an_email
statusReason: 1) XbNz\LaravelAuditableUsers\Tests\Feature\Livewire\EmailVerifiedTest::it_confirms_an_email
Illuminate\Support\ItemNotFoundException: 

/Users/ag/Documents/Projects/laravel-auditable-users/vendor/laravel/framework/src/Illuminate/Collections/Collection.php:1403
/Users/ag/Documents/Projects/laravel-auditable-users/tests/Feature/Livewire/EmailVerifiedTest.php:71

ERRORS!
Tests: 1, Assertions: 1, Err
