[Killed] MethodCallRemoval
Stages/ForgotPassword/DispatchCommand.php:25:9
         Assert::isInstanceOf($payload, Transporter::class);
         Assert::notNull($payload->userUuid);
 
-        $this->commandBus->dispatch(new SendResetEmail(
-            $payload->userUuid,
-            $payload->email,
-        ));
+        
 
         return $payload;
killedBy: XbNz\LaravelAuditableUsers\Tests\Feature\Livewire\ForgotPasswordTest::it_sends_forgot_password_signed_url_through_email
statusReason: 1) XbNz\LaravelAuditableUsers\Tests\Feature\Livewire\ForgotPasswordTest::it_sends_forgot_password_signed_url_through_email
Illuminate\Support\ItemNotFoundException: 

/Users/ag/Documents/Projects/laravel-auditable-users/vendor/laravel/framework/src/Illuminate/Collections/Collection.php:1403
/Users/ag/Documents/Projects/laravel-auditable-users/tests/Feature/Livewire/ForgotPasswordTest.php:38

ERROR
