[Killed] MethodCallRemoval
Stages/PostLogin/DispatchCommand.php:26:9
         Assert::notNull($payload->userAgent);
         Assert::notNull($payload->ipAddress);
 
-        $this->commandBus->dispatch(new CreatePostLoginData(
-            $payload->userUuid,
-            $payload->userAgent,
-            $payload->ipAddress,
-            $payload->email,
-            $payload->rememberToken,
-        ));
+        
 
         return $payload;
killedBy: XbNz\LaravelAuditableUsers\Tests\Feature\Livewire\LoginTest::remember_me_functionality_works
statusReason: 1) XbNz\LaravelAuditableUsers\Tests\Feature\Livewire\LoginTest::remember_me_functionality_works
Illuminate\Support\ItemNotFoundException: 

/Users/ag/Documents/Projects/laravel-auditable-users/vendor/laravel/framework/src/Illuminate/Collections/Collection.php:1403
/Users/ag/Documents/Projects/laravel-auditable-users/tests/Feature/Livewire/LoginTest.php:209

ERRORS!
Tests: 6, Assertions: 17, Errors
