[Killed] MethodCallRemoval
Stages/RegisterUser/DispatchCommand.php:24:9
         Assert::isInstanceOf($payload, Transporter::class);
         Assert::notNull($payload->hashedPassword);
 
-        $this->commandBus->dispatch(new Register(
-            Uuid::uuid7(),
-            $payload->createUserDto->email,
-            $payload->hashedPassword,
-        ));
+        
 
         return $payload;
killedBy: XbNz\LaravelAuditableUsers\Tests\Feature\Livewire\RegisterTest::it_registers_a_user
statusReason: 1) XbNz\LaravelAuditableUsers\Tests\Feature\Livewire\RegisterTest::it_registers_a_user
Illuminate\Database\Eloquent\ModelNotFoundException: No query results for model [XbNz\LaravelAuditableUsers\Projections\User].

/Users/ag/Documents/Projects/laravel-auditable-users/vendor/laravel/framework/src/Illuminate/Database/Eloquent/Builder.php:730
/Users/ag/Documents/Projects/laravel-auditable-users/tests
