[Killed] MethodCallRemoval
Stages/ResetPassword/DispatchCommand.php:26:9
         Assert::isInstanceOf($payload, Transporter::class);
         Assert::notNull($payload->hashedPassword);
 
-        $this->commandBus->dispatch(new ResetPassword(
-            $payload->userUuid,
-            $payload->hashedPassword,
-        ));
+        
 
         return $payload;
killedBy: XbNz\LaravelAuditableUsers\Tests\Feature\Livewire\ResetPasswordTest::it_resets_a_password_if_the_token_is_valid
statusReason: 1) XbNz\LaravelAuditableUsers\Tests\Feature\Livewire\ResetPasswordTest::it_resets_a_password_if_the_token_is_valid
Illuminate\Support\ItemNotFoundException: 

/Users/ag/Documents/Projects/laravel-auditable-users/vendor/laravel/framework/src/Illuminate/Collections/Collection.php:1403
/Users/ag/Documents/Projects/laravel-auditable-users/tests/Feature/Livewire/ResetPasswordTest.php:55

ERRORS!
Tests:
