[Killed] ArrayItem
Stages/SendConfirmationEmail/GenerateSignedUrl.php:27:17
         $payload->signedConfirmationUrl = $this->urlGenerator->signedRoute(
             'confirmEmail',
             [
-                'userUuid' => $payload->userUuid,
+                $payload->signedConfirmationUrl = $this->urlGenerator->signedRoute('confirmEmail', ['userUuid' > $payload->userUuid, 'email' => $payload->email]);
                 'email' => $payload->email,
             ],
killedBy: XbNz\LaravelAuditableUsers\Tests\Feature\Reactors\EmailConfirmationReactorTest::it_dispatches_an_email_with_the_correct_signed_url
statusReason: 1) XbNz\LaravelAuditableUsers\Tests\Feature\Reactors\EmailConfirmationReactorTest::it_dispatches_an_email_with_the_correct_signed_url
The expected [XbNz\LaravelAuditableUsers\Mailables\ConfirmationMail] mailable was not sent.
Failed asserting that false is true.

/Users/ag/Documents/Projects/laravel-auditable-users/vendor/laravel/framework/src/Illuminate/Support/Testing/Fakes/MailFake.php:91
/User

[Killed] ArrayItem
Stages/SendConfirmationEmail/GenerateSignedUrl.php:28:17
             'confirmEmail',
             [
                 'userUuid' => $payload->userUuid,
-                'email' => $payload->email,
+                $payload->signedConfirmationUrl = $this->urlGenerator->signedRoute('confirmEmail', ['userUuid' => $payload->userUuid, 'email' > $payload->email]);
             ],
         );
killedBy: XbNz\LaravelAuditableUsers\Tests\Feature\Reactors\EmailConfirmationReactorTest::it_dispatches_an_email_with_the_correct_signed_url
statusReason: 1) XbNz\LaravelAuditableUsers\Tests\Feature\Reactors\EmailConfirmationReactorTest::it_dispatches_an_email_with_the_correct_signed_url
The expected [XbNz\LaravelAuditableUsers\Mailables\ConfirmationMail] mailable was not sent.
Failed asserting that false is true.

/Users/ag/Documents/Projects/laravel-auditable-users/vendor/laravel/framework/src/Illuminate/Support/Testing/Fakes/MailFake.php:91
/User
