[Killed] MethodCallRemoval
Stages/SendConfirmationEmail/SendConfirmationEmail.php:27:9
         Assert::isInstanceOf($payload, Transporter::class);
         Assert::notNull($payload->signedConfirmationUrl);
 
-        $this->mailer
-            ->to($payload->email)
-            ->send(new ConfirmationMail(new ConfirmationEmailViewModel($payload->signedConfirmationUrl)));
+        
 
         return $payload;
killedBy: XbNz\LaravelAuditableUsers\Tests\Feature\Reactors\EmailConfirmationReactorTest::it_dispatches_an_email_with_the_correct_signed_url
statusReason: 1) XbNz\LaravelAuditableUsers\Tests\Feature\Reactors\EmailConfirmationReactorTest::it_dispatches_an_email_with_the_correct_signed_url
The total number of mailables sent was 0 instead of 1.
Failed asserting that 0 is identical to 1.

/Users/ag/Documents/Projects/laravel-auditable-users/vendor/laravel/framework/src/Illuminate/Support/Testing/Fakes/MailFake.php:287
/Users/ag/Documents/Projects/larave
