[Survived] IncrementInteger
Stages/SendResetEmail/GenerateResetToken.php:28:9
     {
         Assert::isInstanceOf($payload, Transporter::class);
 
-        $payload->hashedResetToken = $this->hasher->make($randomString = Str::random(40));
+        $payload->hashedResetToken = $this->hasher->make($randomString = Str::random(41));
 
         $this->commandBus->dispatch(new CreateResetToken(

[Survived] DecrementInteger
Stages/SendResetEmail/GenerateResetToken.php:28:9
     {
         Assert::isInstanceOf($payload, Transporter::class);
 
-        $payload->hashedResetToken = $this->hasher->make($randomString = Str::random(40));
+        $payload->hashedResetToken = $this->hasher->make($randomString = Str::random(39));
 
         $this->commandBus->dispatch(new CreateResetToken(

[Killed] MethodCallRemoval
Stages/SendResetEmail/GenerateResetToken.php:30:9
 
         $payload->hashedResetToken = $this->hasher->make($randomString = Str::random(40));
 
-        $this->commandBus->dispatch(new CreateResetToken(
-            $payload->userUuid,
-            $randomString,
-        ));
+        
 
         return $payload;
killedBy: XbNz\LaravelAuditableUsers\Tests\Feature\Reactors\PasswordResetEmailReactorTest::it_dispatches_an_email_with_the_correct_signed_url_and_reset_token
statusReason: 1) XbNz\LaravelAuditableUsers\Tests\Feature\Reactors\PasswordResetEmailReactorTest::it_dispatches_an_email_with_the_correct_signed_url_and_reset_token
Illuminate\Support\ItemNotFoundException: 

/Users/ag/Documents/Projects/laravel-auditable-users/vendor/laravel/framework/src/Illuminate/Collections/Collection.php:1403
/Users/ag/Documents/Projects/laravel-auditable-users/tests/Feature/Reactors/Pass
