[Killed] ArrayItemRemoval
Stages/SendResetEmail/GenerateSignedUrl.php:29:13
         $payload->signedResetUrl = $this->urlGenerator->temporarySignedRoute(
             'resetPassword',
             CarbonImmutable::now()->addMinutes(30),
-            [
-                'userUuid' => $payload->userUuid,
-                'token' => urlencode($payload->hashedResetToken),
-            ],
+            $payload->signedResetUrl = $this->urlGenerator->temporarySignedRoute('resetPassword', CarbonImmutable::now()->addMinutes(30), ['token' => urlencode($payload->hashedResetToken)]);,
         );
 
killedBy: XbNz\LaravelAuditableUsers\Tests\Feature\Reactors\PasswordResetEmailReactorTest::it_dispatches_an_email_with_the_correct_signed_url_and_reset_token
statusReason: 1) XbNz\LaravelAuditableUsers\Tests\Feature\Reactors\PasswordResetEmailReactorTest::it_dispatches_an_email_with_the_correct_signed_url_and_reset_token
Illuminate\Routing\Exceptions\UrlGenerationException: Missing required parameter for [Route: resetPassword] [URI: reset-password/{userUuid}] [Missing parameter: userUuid].

/Users/ag/Documents/Projects/laravel-auditable-users/vendor/laravel/framewor
