[Killed] MethodCallRemoval
Stages/SendResetEmail/SendResetEmail.php:27:9
         Assert::isInstanceOf($payload, Transporter::class);
         Assert::notNull($payload->signedResetUrl);
 
-        $this->mailer
-            ->to($payload->email)
-            ->send(new ResetMail(new ResetEmailViewModel($payload->signedResetUrl)));
+        
 
         return $payload;
killedBy: XbNz\LaravelAuditableUsers\Tests\Feature\Reactors\PasswordResetEmailReactorTest::it_dispatches_an_email_with_the_correct_signed_url_and_reset_token
statusReason: 1) XbNz\LaravelAuditableUsers\Tests\Feature\Reactors\PasswordResetEmailReactorTest::it_dispatches_an_email_with_the_correct_signed_url_and_reset_token
The total number of mailables sent was 0 instead of 1.
Failed asserting that 0 is identical to 1.

/Users/ag/Documents/Projects/laravel-auditable-users/vendor/laravel/framework/src/Illuminate/Support/Testing/Fakes/MailFake.php:287
/Users/ag/Document
