[Killed] MethodCallRemoval
UserAggregateRoot.php:33:9
 
     public function register(Register $command): self
     {
-        $this->recordThat(
-            new UserRegistered(
-                $command->userUuid,
-                $command->email,
-                $command->hashedPassword,
-            )
-        );
+        
 
         return $this;
killedBy: XbNz\LaravelAuditableUsers\Tests\Feature\AggregateRoots\UserAggregateRoot\RegisterTest::it_registers_a_user
statusReason: 1) XbNz\LaravelAuditableUsers\Tests\Feature\AggregateRoots\UserAggregateRoot\RegisterTest::it_registers_a_user
Failed asserting that two arrays are equal.
--- Expected
+++ Actual
@@ @@
 Array (
-    0 => XbNz\LaravelAuditableUsers\StoredEvents\UserRegistered Object (...)
 )

[Killed] MethodCallRemoval
UserAggregateRoot.php:48:9
     {
         Assert::eq($this->confirmationState, ConfirmationState::Unverified);
 
-        $this->recordThat(
-            new UserConfirmed(
-                $command->userUuid,
-                $command->email,
-            )
-        );
+        
     }
 
killedBy: XbNz\LaravelAuditableUsers\Tests\Feature\AggregateRoots\UserAggregateRoot\ConfirmTest::it_confirms_a_user
statusReason: 1) XbNz\LaravelAuditableUsers\Tests\Feature\AggregateRoots\UserAggregateRoot\ConfirmTest::it_confirms_a_user
Failed asserting that two arrays are equal.
--- Expected
+++ Actual
@@ @@
 Array (
-    0 => XbNz\LaravelAuditableUsers\StoredEvents\UserConfirmed Object (...)
 )

[Killed] MethodCallRemoval
UserAggregateRoot.php:58:9
 
     public function createPostLoginData(CreatePostLoginData $command): void
     {
-        $this->recordThat(
-            new UserPostLoginDataCreated(
-                $command->userUuid,
-                $command->userAgent,
-                $command->ipAddress,
-                $command->email,
-                $command->rememberToken,
-            )
-        );
+        
     }
 
killedBy: XbNz\LaravelAuditableUsers\Tests\Feature\AggregateRoots\UserAggregateRoot\CreatePostLoginDataTest::it_creates_a_post_login_data_record
statusReason: 1) XbNz\LaravelAuditableUsers\Tests\Feature\AggregateRoots\UserAggregateRoot\CreatePostLoginDataTest::it_creates_a_post_login_data_record
Failed asserting that two arrays are equal.
--- Expected
+++ Actual
@@ @@
 Array (
-    0 => XbNz\LaravelAuditableUsers\StoredEvents\UserPostLoginDataCreated Object (...)
 )

[Killed] MethodCallRemoval
UserAggregateRoot.php:71:9
 
     public function sendResetEmail(SendResetEmail $command): void
     {
-        $this->recordThat(
-            new UserResetEmailSent(
-                $command->userUuid,
-                $command->email,
-            )
-        );
+        
     }
 
killedBy: XbNz\LaravelAuditableUsers\Tests\Feature\Livewire\ForgotPasswordTest::it_sends_forgot_password_signed_url_through_email
statusReason: 1) XbNz\LaravelAuditableUsers\Tests\Feature\Livewire\ForgotPasswordTest::it_sends_forgot_password_signed_url_through_email
Illuminate\Support\ItemNotFoundException: 

/Users/ag/Documents/Projects/laravel-auditable-users/vendor/laravel/framework/src/Illuminate/Collections/Collection.php:1403
/Users/ag/Documents/Projects/laravel-auditable-users/tests/Feature/Livewire/ForgotPasswordTest.php:38

ERROR

[Killed] MethodCallRemoval
UserAggregateRoot.php:81:9
 
     public function createResetToken(CreateResetToken $command): void
     {
-        $this->recordThat(
-            new UserResetTokenCreated(
-                $command->userUuid,
-                $command->plainTextToken,
-            )
-        );
+        
     }
 
killedBy: XbNz\LaravelAuditableUsers\Tests\Feature\AggregateRoots\UserAggregateRoot\CreateResetTokenTest::it_create_a_password_reset_token_record
statusReason: 1) XbNz\LaravelAuditableUsers\Tests\Feature\AggregateRoots\UserAggregateRoot\CreateResetTokenTest::it_create_a_password_reset_token_record
Failed asserting that two arrays are equal.
--- Expected
+++ Actual
@@ @@
 Array (
-    0 => XbNz\LaravelAuditableUsers\StoredEvents\UserResetTokenCreated Object (...)
 )

[Killed] MethodCallRemoval
UserAggregateRoot.php:91:9
 
     public function resetPassword(ResetPassword $command): void
     {
-        $this->recordThat(
-            new UserPasswordReset(
-                $command->userUuid,
-                $command->hashedNewPassword
-            )
-        );
+        
     }
 
killedBy: XbNz\LaravelAuditableUsers\Tests\Feature\AggregateRoots\UserAggregateRoot\ResetPasswordTest::resets_password
statusReason: 1) XbNz\LaravelAuditableUsers\Tests\Feature\AggregateRoots\UserAggregateRoot\ResetPasswordTest::resets_password
Failed asserting that two arrays are equal.
--- Expected
+++ Actual
@@ @@
 Array (
-    0 => XbNz\LaravelAuditableUsers\StoredEvents\UserPasswordReset Object (...)
 )

[Killed] MethodCallRemoval
UserAggregateRoot.php:101:9
 
     public function clearResetTokens(ClearResetTokens $command): void
     {
-        $this->recordThat(
-            new UserResetTokensCleared($command->userUuid)
-        );
+        
     }
 
killedBy: XbNz\LaravelAuditableUsers\Tests\Feature\Reactors\PasswordResetReactorTest::it_clears_reset_tokens
statusReason: 1) XbNz\LaravelAuditableUsers\Tests\Feature\Reactors\PasswordResetReactorTest::it_clears_reset_tokens
Illuminate\Support\ItemNotFoundException: 

/Users/ag/Documents/Projects/laravel-auditable-users/vendor/laravel/framework/src/Illuminate/Collections/Collection.php:1403
/Users/ag/Documents/Projects/laravel-auditable-users/tests/Feature/Reactors/PasswordResetReactorTest.php:42

ERRORS!
Tests: 1, As
